def getSpaDigiXdingweideshu(year , month , day , hour):
    from functionSpaDigiXAPPONE import getthebasicmessageofnineGrids
    year = year
    month = month
    day = day
    hour = hour
    fanhuixinxi = getthebasicmessageofnineGrids(year, month, day, hour)  # 通过应用0获得排盘的基本信息
    ninegridsbasicmessage = fanhuixinxi[0]  # 九宫基本信息
    yinyangdun_ganzhi = fanhuixinxi[1]  # 阴阳遁和干支信息
    YD = yinyangdun_ganzhi[0]
    nianganzhi = yinyangdun_ganzhi[1]
    yueganzhi = yinyangdun_ganzhi[2]
    riganzhi = yinyangdun_ganzhi[3]  # 日干支
    shichengganzhi = yinyangdun_ganzhi[4]
    zhishiluozhongwugongjikungong = yinyangdun_ganzhi[7]
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            bamenpanbiezhishi = ninegridsbasicmessage[i]["八门"]
            if "使" in bamenpanbiezhishi:
                zhishigongdingwei_index = i  # 这个编号代表值使所在宫的代号
    SpaDigiX_APPONE_Value = 0
    # 第一套基础编码
    # 请在此处调整数据
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # 1 全盘初判
    # 1.1 值使宫（值使用神），落内遁-1，落外遁+1
    luoneidun = -1  # 落内遁
    luowaidun = +1  # 落外遁
    # -----------------------------------------------------------------------------------------------------------------------
    # 同边要素
    yitong = +2
    ertong = +1
    sitongqietonggong = -1
    wutongqietonggong = -1
    liutong = -1
    qitong = -2
    batong = -2
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.4 驿马落（冲）用神宫
    yimaluoyongshengong = -1  # 落用神宫
    yimachongyongshengong = -1  # 冲用神宫
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.5 用神宫空亡
    yongshengongdankong = +1  # 单空
    yongshengongshuangkong = +2  # 双空
    yongshengongsikong = +4  # 四空
    # -----------------------------------------------------------------------------------------------------------------------
    # 支冲
    zhichongone = +1
    zhichongtwo = +2
    # -----------------------------------------------------------------------------------------------------------------------
    # 2 单宫部分
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.1 吉格
    wubing = -3  # 戊＋丙
    bingwu = -3  # 丙＋戊
    bingding = -1  # 丙＋丁
    yiwu_kaimen = -1  # 乙＋戊（开门）
    yiji_kaimen = -1  # 乙＋己（开门）
    tianpanding_xiumen_taiyin = -1  # 丁（休门）＋ 太阴神
    yi_kaixiusheng_xunsi = -1  # 乙（开门或休门或生门）＋巽四宫
    yixin_kaixiusheng = -1  # 乙＋辛（开门或休门或生门）
    yi_kaixiusheng_kanyigui = -1  # 乙（开门或休门或生门）＋坎一宫或癸
    yixin_xiusheng_genba = -1  # 乙＋辛（休门或生门）＋艮八宫
    yi_du_jiudi = -1  # 乙（杜门）＋九地神
    bing_sheng_jiutian = -1  # 丙（生门）＋九天神
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.2 三奇得使
    yijiaxu = -1  # 乙＋甲戌
    dingjiachen = -1  # 丁＋甲辰
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.3 玉女守门 （暂不考虑）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.4 三诈
    yiorbingording_kai_taiyin = -1  # 乙、丙、丁（开门）十神盘（太阴）
    yiorbingording_xiu_jiudi = -1  # 乙、丙、丁（体门）十神盘（九地）
    yiorbingording_sheng_liuhe = -1  # 乙、丙、丁（生门）十神盘（六合）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.5 五假
    yiorbingording_jing_jiutian = -1  # 乙、丙、丁十景门（九天）
    dingorjiorgui_du_jiuditaiyinliuhe = -1  # 丁、已、癸十杜门（九地、太阴、六合）
    dingorjiorgui_du_shang_liuhe = -1  # 丁、已、癸十伤门（六合）
    ren_jing_jiutian = -1  # 六壬十惊门（九天）
    dingorjiorgui_si_jiudi = -1  # 丁、已、癸十死门（九地）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.6 三奇升殿、奇游禄位 均为-1
    yi_kaixiusheng_zhengsan = -1  # 乙（震）（开、休、生）
    bing_kaixiusheng_lijiu = -1  # 丙（离）（开、休、生）
    ding_kaixiusheng_duiqi = -1  # 丁（兑）（开、休、生）
    bing_kaixiusheng_xunsi = -1  # 丙（巽）（开、休、生）
    ding_kaixiusheng_lijiu = -1  # 丁（离）（开、休、生）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.7 奇仪相合 加0 不考虑
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.8 交泰格、天运格
    yiding = -1  # 乙十丁
    dingbing = -1  # 丁十丙
    dingyi = -1  # 丁十乙
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.9 欢怡、相佐
    yiordingjiaziwu = -1  # 乙、丙、丁十六甲值符 ----->去掉丙，改六甲值符为甲子戊
    jiaziwuyiording = -1  # 六甲值符十乙、丙、丁 ----->去掉丙，改六甲值符为甲子戊
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.10 凶格
    gengbing = +3  # 庚十丙
    binggeng = +3  # 丙十庚
    yixin = +1  # 乙十辛
    xinyi = +1  # 辛十乙
    guiding = +1  # 癸十丁
    dinggui = +1  # 丁十癸
    jiaziwugeng = +3  # 六甲值符十庚 ----->改六甲值符为甲子戊
    gengjiaziwu = +3  # 庚十六甲值符 ----->改六甲值符为甲子戊
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.11 其他凶格（更凶）
    gengji = +2  # 刑格
    genggui = +2  # 大格
    gengren = +2  # 小格
    gengniangan = +2  # 岁格
    gengyuegan = +2  # 月格
    gengrigan = +2  # 日格
    gengshigan = +2  # 时格
    rigangeng = +2  # 飞干格
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.12 三奇入暮、时干入暮
    yi_qiankun = +1  # 乙（乾、坤）
    bing_qianliu = +1  # 丙（乾）
    ding_genqian = +1  # 丁（艮、乾）
    shiganwuxu = +1  # 戊戌
    shiganrencheng = +1  # 壬辰
    shiganbingxu = +1  # 丙戌
    shiganguiwei = +1  # 癸未
    shigandingchou = +1  # 丁丑
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.13 六仪击刑
    jiaziwu_zhengsan = +1  # 甲子戊（震）
    jiaxuji_kuner = +1  # 甲戌已（坤）
    jiashengeng_genba = +1  # 甲申庚（艮）
    jiawuxin_lijiu = +1  # 甲午辛（离）
    jiachenren_xunsi = +1  # 甲辰王（巽）
    jiayingui_xunsi = +1  # 甲寅癸（巽）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.14 奇格
    gengyiorbingording = +1  # 庚十乙、丙、丁
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.15 天网
    jiaziwugui = +1  # 六甲值符十癸 ----->六甲值符改为甲子戊
    guigui = +1  # 癸十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.16 五不遇时  （暂时不考虑）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17 其他格
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.1 甲
    jiayi_jimen = -1  # 甲十乙(门吉)
    jiayi_xiongmen = +1  # 甲十乙(门凶)
    jiaxin_xiongmen = +1  # 甲十辛（门凶）
    jiaren = +1  # 甲十壬
    jiagui_jimen = -1  # 甲+癸(门吉)
    jiagui_xiongmen = +1  # 甲+癸(门凶)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.2 乙
    yijia = -1  # 乙十甲
    yibing = -2  # 乙十丙
    yibing_xiongmenxiongxin = +1  # 乙十丙（凶门星凶）
    yiding = -1  # 乙十丁
    yiyi = -1  # 乙+乙
    yiwu = -1  # 乙十戊
    yiwu_xiongmenmenpo = +1  # 乙十戊（门凶门迫）
    yiji_jimen = -1  # 乙十己（三吉门）
    yiji_jimenchuwai = +1  # 乙十己（吉门除外）
    yigeng_kai_xun = -1  # 乙十庚（巽宫开门）
    yigeng_qita = +1  # 乙十庚（其他情况）
    yixin_sheng_gen = -1  # 乙十辛(艮宫、生门)
    yixin_kai_kun = -1  # 乙十辛(坤宫、开门)
    yixin_qita = +1  # 乙十辛(其他情况)
    yiren_xiongmen = +1  # 乙十壬（门凶）
    yiren_jimen = -1  # 乙十壬（门吉）
    yigui_jimen = -1  # 乙十癸(门吉)
    yigui_qita = +1  # 乙十癸(其他情况)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.3 丙
    bingyi = -1  # 丙十乙
    bingbing = +1  # 丙十丙
    bingding = -2  # 丙十丁
    bingji_jimen = -1  # 丙十已（吉门)
    bingji_xiongmen = +1  # 丙十已（凶门)
    bingxin = +1  # 丙十辛
    bingren = +1  # 丙十壬
    binggui = +2  # 丙十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.4 丁
    dingjia = -1  # 丁十甲
    dingding = -1  # 丁十丁
    dingwu = -1  # 丁十戊
    dingji = +1  # 丁十己
    dinggeng = +1  # 丁十庚
    dingxin = +1  # 丁十辛
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.5 戊
    wujia_jimen = -1  # 戊十甲（门吉）
    wuyi_jimen = -1  # 戊十乙(门吉)
    wuyi_xiongmen = +1  # 戊十乙(门凶)
    wuding = +1  # 戊十丁
    wuwu = +1  # 戊十戊
    wuxin_jimen = -1  # 戊十辛(门吉)
    wuxin_xiongmen = +1  # 戊十辛(门凶)
    wuren = +1  # 戊十壬
    jiaziwugui_mengongxiangshen = -1  # 戊十癸(门宫相生)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.6 己
    jijia = +1  # 己十甲
    jiyi = +1  # 己十乙
    jibing = +1  # 己十丙
    jiding = -1  # 己十丁
    jiji = +1  # 己十己
    jigeng = +1  # 己十庚
    jixin = +1  # 己十辛
    jiren = +1  # 己十壬
    jigui = +1  # 己十癸
    # -----------------------------------------------------------------------------------------------------------------------、
    # 2.17.7 庚
    gengding = +1  # 庚十丁
    gengding_jimen = -1  # 庚十丁（吉门）
    genggeng = +2  # 庚十庚
    gengwu = +3  # 庚+戊
    gengxin = +2  # 庚十辛
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.8 辛
    xinjia = +1  # 辛十甲
    xinbing_jimen = -1  # 辛十丙（门吉）
    xinbing_qita = +1  # 辛十丙（其他门）
    xinding = -1  # 辛十丁
    xinwu = +1  # 辛十戊
    xinji = +1  # 辛十己
    xingeng = +2  # 辛十庚
    xinxin = +1  # 辛十辛
    xinren = +1  # 辛十壬
    xingui = +1  # 辛十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.9 壬
    renjia = +1  # 壬十甲
    renyi = +1  # 壬十乙
    renbing = +1  # 壬十丙
    renwu = +1  # 壬十戊
    renji = +1  # 壬十己
    renxin = +1  # 壬十辛
    rengui = +1  # 壬十癸
    rending = +1  # 壬+丁
    rengeng = +1  # 壬+庚
    renren = +1  # 壬+壬
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.10 癸
    guijia = -1  # 癸十甲
    guiyi_jimen = -1  # 癸十乙（门吉）
    guiyi_qita = +1  # 癸十乙（其他门）
    guibing = +2  # 癸十丙
    guiding = +1  # 癸十丁
    guiwu = -1  # 癸十戊
    guiwu_xiongmenpozhi = +1  # 癸十戊（门凶廹制）
    guiji = +1  # 癸十己
    guigeng = +2  # 癸十庚
    guixin = +1  # 癸十辛
    guiren = +1  # 癸十壬
    # -----------------------------------------------------------------------------------------------------------------------
    # 3 单宫天盘干定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.1 十二个月份各干定数数据
    month_dict_dangongtianpangandingshu = {
        "寅": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        "卯": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        "辰": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "巳": {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "午": {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "未": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "申": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "酉": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "戌": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "亥": {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        "子": {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        "丑": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.2 九宫各天盘干定数数据
    palace_dict_dangongtianpangandingshu = {
        0: {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        1: {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        2: {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        3: {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        5: {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        6: {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        7: {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        8: {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.3天盘干与地盘干五行力量消长定数数据
    tianpandingwei_dict_dangongtianpangandingshu = {
        "甲": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": -1, "癸": -1},
        "乙": {"甲": -1, "乙": -1, "丙": 0, "丁": 0, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": -1, "癸": -1},
        "丙": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 0, "己": 0, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "丁": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 0, "己": 0, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "戊": {"甲": 1, "乙": 1, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 0, "辛": 0, "壬": 1, "癸": 1},
        "己": {"甲": 0, "乙": 1, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 0, "辛": 0, "壬": 1, "癸": 1},
        "庚": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 0, "癸": 0},
        "辛": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 0, "癸": 0},
        "壬": {"甲": 0, "乙": 0, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "癸": {"甲": 0, "乙": 0, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": -1, "辛": -1, "壬": -1, "癸": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.4 天盘干 长生 帝旺 墓 绝 十二宫得数：
    changshenglinguandiwang = -2  # 天盘干位于 长生 临官 帝旺
    guandaishuai = -1  # 天盘干位于 冠带 衰
    taiyangmuyu = 0  # 天盘干位于 胎 养 沐浴
    bingsijue = +2  # 天盘干位于 病 死 绝
    mu = +1  # 天盘干位于 墓
    # 动物宫与天盘干对应表
    tianpanganduiyingongweishengxiao = {
        "甲": ["亥", "子", "丑", "寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌"],
        "乙": ["午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未"],
        "丙": ["寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
        "丁": ["酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
        "戊": ["寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
        "己": ["酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
        "庚": ["已", "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰"],
        "辛": ["子", "亥", "戌", "酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑"],
        "壬": ["申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "已", "午", "未"],
        "癸": ["卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "已", "辰"]
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4 单宫九星力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.1 十二月各星力量
    yuefenduiyingjiuxingliliang = {
        "寅": {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        "卯": {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 0, "天柱": 1, "天任": 1, "天英": 1},
        "辰": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": -1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        "巳": {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": -1},
        "午": {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": -1},
        "未": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 0, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        "申": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        "酉": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 0},
        "戌": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 0, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        "亥": {"天蓬": -1, "天芮": 0, "天冲": 1, "天辅": 1, "天禽": 1, "天心": -1, "天柱": -1, "天任": 0, "天英": 1},
        "子": {"天蓬": -1, "天芮": 1, "天冲": 1, "天辅": 1, "天禽": 1, "天心": -1, "天柱": -1, "天任": 1, "天英": 1},
        "丑": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.2 九宫各星力量
    jiugonggexingliliangshuju = {
        0: {"天蓬": -1, "天芮": 1, "天冲": 1, "天辅": 1, "天禽": 0, "天心": -1, "天柱": -1, "天任": 1, "天英": 1},
        1: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        2: {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        3: {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        5: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        6: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        7: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 0, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        8: {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.3 吉凶星变化
    jiuxingyutianpanganbianhuashuju = {
        "天辅": {"甲": -1, "乙": -1, "丙": -1, "丁": -1},
        "天禽": {"戊": -1, "己": -1, "庚": -1, "辛": -1},
        "天心": {"庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "天冲": {"甲": -1, "乙": -1, "丙": -1, "丁": -1},
        "天英": {"丙": -1, "丁": -1, "戊": -1, "己": -1},
        "天蓬": {"甲": 1, "乙": 1, "戊": 1, "己": 1},
        "天芮": {"丙": 1, "丁": 1, "壬": 1, "癸": 1},
        "天柱": {"丙": 1, "丁": 1, "戊": 1, "己": 1},
        "天任": {"戊": -1, "己": -1, "庚": -1, "辛": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5 单宫八门力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.1 八门在十二个月力量
    bamenshieryueshuju = {
        "寅": {"开": 0, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        "卯": {"开": 0, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        "辰": {"开": -1, "休": 1, "生": -1, "伤": +1, "杜": +1, "景": 0, "死": -1, "惊": -1},
        "巳": {"开": 1, "休": 1, "生": -1, "伤": -1, "杜": -1, "景": -1, "死": 0, "惊": 1},
        "午": {"开": 1, "休": 1, "生": -1, "伤": 0, "杜": -1, "景": -1, "死": -1, "惊": 1},
        "未": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": -1},
        "申": {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 0, "惊": -1},
        "酉": {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 0, "惊": -1},
        "戌": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "亥": {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": 1},
        "子": {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": 1},
        "丑": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": 0, "死": -1, "惊": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.2 八门在九宫中力量消长
    bamenjiugongliliangxiaozhangshuju = {
        0: {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": 0},
        1: {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": -1},
        2: {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        3: {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        5: {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        6: {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        7: {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": -1},
        8: {"开": 1, "休": 1, "生": -1, "伤": -1, "杜": -1, "景": -1, "死": -1, "惊": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.3 几种特殊门遇天盘干 地盘干的变化
    # 遇地盘干
    menyudipanganshuju = {
        "开": {"丙": -1, "丁": -1, "戊": -1, "己": -1},
        "休": {"庚": -1, "辛": -1, "戊": -1, "己": -1},
        "生": {"甲": -1, "乙": -1, "壬": -1, "癸": -1},
        "死": {"庚": 1, "辛": 1, "戊": 1, "己": 1},
        "惊": {"壬": 1, "癸": 1, "庚": 1, "辛": 1}
    }
    # 遇天盘干
    menyutianpanganshuju = {
        "开": {"庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "休": {"甲": -1, "乙": -1, "壬": -1, "癸": -1},
        "生": {"庚": -1, "辛": -1, "戊": -1, "己": -1},
        "死": {"壬": 1, "癸": 1, "甲": 1, "乙": 1},
        "惊": {"甲": 1, "乙": 1, "丙": 1, "丁": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 6 八神单宫力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.1 八神在十二月力量消长
    bashenshieryueliliangxiaozhangshuju = {
        "寅": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 0, "九地": 1, "九天": 1},
        "卯": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 0, "九地": 1, "九天": 1},
        "辰": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "巳": {"值符": 0, "螣蛇": -1, "太阴": 1, "六合": 0, "白虎": 1, "玄武": 1, "九地": -1, "九天": 1},
        "午": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": 0, "白虎": 1, "玄武": 1, "九地": -1, "九天": 1},
        "未": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "申": {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": -1, "九地": 0, "九天": -1},
        "酉": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": -1, "九地": 0, "九天": -1},
        "戌": {"值符": 0, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "亥": {"值符": -1, "螣蛇": 1, "太阴": 0, "六合": -1, "白虎": 0, "玄武": -1, "九地": 1, "九天": 0},
        "子": {"值符": -1, "螣蛇": 1, "太阴": 0, "六合": -1, "白虎": 0, "玄武": -1, "九地": 1, "九天": 0},
        "丑": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.2 八神在九宫内力量消长
    bashenzaijiugongliliangxiaozhangshuju = {
        0: {"值符": 0, "螣蛇": 1, "太阴": -1, "六合": 0, "白虎": -1, "玄武": -1, "九地": 1, "九天": -1},
        1: {"值符": 1, "螣蛇": -1, "太阴": 0, "六合": 1, "白虎": 0, "玄武": 1, "九地": -1, "九天": 0},
        2: {"值符": -1, "螣蛇": 0, "太阴": 1, "六合": -1, "白虎": 1, "玄武": -1, "九地": 1, "九天": 1},
        3: {"值符": -1, "螣蛇": 0, "太阴": 1, "六合": -1, "白虎": 1, "玄武": -1, "九地": 1, "九天": 1},
        5: {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 0, "九地": -1, "九天": -1},
        6: {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 0, "九地": -1, "九天": -1},
        7: {"值符": 0, "螣蛇": -1, "太阴": 0, "六合": 1, "白虎": 0, "玄武": 1, "九地": -1, "九天": 0},
        8: {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 1, "九地": 0, "九天": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------

    # 一、全盘初判
    print("-------------------------------------\n1 全盘初判")
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.1 值使宫（值使用神），落内遁-1，落外遁+1
    # ------------------------------------
    zuocegonghao = [0, 7, 2, 3]
    youcegonghao = [8, 1, 6, 5]
    yinyangdun = yinyangdun_ganzhi[0]
    JQ = yinyangdun_ganzhi[5]
    if yinyangdun == "阳遁" and zhishiluozhongwugongjikungong == 5:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 3
        print("----------------------")
        print("阳遁，值使落中五宫寄坤二宫：-3")
    elif yinyangdun == "阴遁" and zhishiluozhongwugongjikungong == 5:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        print("----------------------")
        print("阴遁，值使落中五宫寄坤二宫：3")
    if yinyangdun == "阳遁":
        if zhishigongdingwei_index in zuocegonghao:
            BIAN = 0
            dun = "内遁"
        elif zhishigongdingwei_index in youcegonghao:
            BIAN = 1
            dun = "外遁"
    else:
        if zhishigongdingwei_index in zuocegonghao:
            BIAN = 0
            dun = "外遁"
        elif zhishigongdingwei_index in youcegonghao:
            BIAN = 1
            dun = "内遁"
    if dun == "内遁":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + luoneidun  ###落在内遁
        if luoneidun >= 0:
            dunjian = f"{luoneidun}"
        else:
            dunjian = f"{luoneidun}"
    elif dun == "外遁":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + luowaidun  ###落在外遁
        if luowaidun >= 0:
            dunjian = f"{luowaidun}"
        else:
            dunjian = f"{luowaidun}"
    print(f"落{dun}--->{dunjian}")
    neiwaidunzuizhong=SpaDigiX_APPONE_Value
    # -------------------------------------
    # 1.2 值使为用神，同边八要素加减规则
    # -------------------------------------
    # 八要素所在宫号获取
    # 值符
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            bashenpanbiezhifu = ninegridsbasicmessage[i]["八神"]
            if bashenpanbiezhifu == "值符":
                zhifugongdingwei_index = i  # 值符所在宫号
    # 生门
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            bamenpanbieshengmen = ninegridsbasicmessage[i]["八门"]
            if bamenpanbieshengmen == "生" or bamenpanbieshengmen == "生使":
                shengmendingwei_index = i  # 生门所在宫号
            else:
                pass
    # 甲子戊
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbiejiaziwu = ninegridsbasicmessage[i]["天盘"]
            if len(tianpanpanbiejiaziwu) == 1:
                pass
            elif len(tianpanpanbiejiaziwu) == 3:
                if tianpanpanbiejiaziwu == "甲子戊":
                    jiaziwudingwei_index = i
            else:
                tianpanchaifenliebiao = tianpanpanbiejiaziwu.split("\n")
                if len(tianpanchaifenliebiao[0]) == 1:
                    if tianpanchaifenliebiao[1] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号
                elif len(tianpanchaifenliebiao[1]) == 1:
                    if tianpanchaifenliebiao[0] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号
                else:
                    if tianpanchaifenliebiao[0] == "甲子戊" or tianpanchaifenliebiao[1] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号

    # 干支
    nianganzhi = yinyangdun_ganzhi[1]
    yueganzhi = yinyangdun_ganzhi[2]
    riganzhi = yinyangdun_ganzhi[3]
    shichengganzhi = yinyangdun_ganzhi[4]
    # 年干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieniangan = ninegridsbasicmessage[i]["天盘"]
            if nianganzhi[0] == "甲":
                if len(tianpanpanbieniangan) == 1:
                    pass
                elif len(tianpanpanbieniangan) == 3:
                    if nianganzhi == tianpanpanbieniangan[0:2]:
                        niangandingwei_index = i
                else:
                    tianpanpanbienianganliebiao = tianpanpanbieniangan.split("\n")
                    if len(tianpanpanbienianganliebiao[0]) == 1:
                        if nianganzhi == tianpanpanbienianganliebiao[1][0:2]:
                            niangandingwei_index = i
                    elif len(tianpanpanbienianganliebiao[1]) == 1:
                        if nianganzhi == tianpanpanbienianganliebiao[0][0:2]:
                            niangandingwei_index = i
                    else:
                        if nianganzhi == tianpanpanbienianganliebiao[0][0:2] or nianganzhi == \
                                tianpanpanbienianganliebiao[1][0:2]:
                            niangandingwei_index = i
            else:
                if len(tianpanpanbieniangan) == 1:
                    if nianganzhi[0] == tianpanpanbieniangan:
                        niangandingwei_index = i
                elif len(tianpanpanbieniangan) == 3:
                    if nianganzhi[0] == tianpanpanbieniangan[-1]:
                        niangandingwei_index = i
                else:
                    tianpanpanbienianganliebiao = tianpanpanbieniangan.split("\n")
                    if nianganzhi[0] == tianpanpanbienianganliebiao[0][-1] or nianganzhi[0] == \
                            tianpanpanbienianganliebiao[1][-1]:
                        niangandingwei_index = i
    # 月干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieyuegan = ninegridsbasicmessage[i]["天盘"]
            if yueganzhi[0] == "甲":
                if len(tianpanpanbieyuegan) == 1:
                    pass
                elif len(tianpanpanbieyuegan) == 3:
                    if yueganzhi == tianpanpanbieyuegan[0:2]:
                        yuegandingwei_index = i
                else:
                    tianpanpanbieyueganliebiao = tianpanpanbieyuegan.split("\n")
                    if len(tianpanpanbieyueganliebiao[0]) == 1:
                        if yueganzhi == tianpanpanbieyueganliebiao[1][0:2]:
                            yuegandingwei_index = i
                    elif len(tianpanpanbieyueganliebiao[1]) == 1:
                        if yueganzhi == tianpanpanbieyueganliebiao[0][0:2]:
                            yuegandingwei_index = i
                    else:
                        if yueganzhi == tianpanpanbieyueganliebiao[0][0:2] or yueganzhi == tianpanpanbieyueganliebiao[
                                                                                               1][0:2]:
                            yuegandingwei_index = i
            else:
                if len(tianpanpanbieyuegan) == 1:
                    if yueganzhi[0] == tianpanpanbieyuegan:
                        yuegandingwei_index = i
                elif len(tianpanpanbieyuegan) == 3:
                    if yueganzhi[0] == tianpanpanbieyuegan[-1]:
                        yuegandingwei_index = i
                else:
                    tianpanpanbieyueganliebiao = tianpanpanbieyuegan.split("\n")
                    if yueganzhi[0] == tianpanpanbieyueganliebiao[0][-1] or yueganzhi[0] == \
                            tianpanpanbieyueganliebiao[1][-1]:
                        yuegandingwei_index = i

    # 日干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbierigan = ninegridsbasicmessage[i]["天盘"]
            if riganzhi[0] == "甲":
                if len(tianpanpanbierigan) == 1:
                    pass
                elif len(tianpanpanbierigan) == 3:
                    if riganzhi == tianpanpanbierigan[0:2]:
                        rigandingwei_index = i
                else:
                    tianpanpanbieriganliebiao = tianpanpanbierigan.split("\n")
                    if len(tianpanpanbieriganliebiao[0]) == 1:
                        if riganzhi == tianpanpanbieriganliebiao[1][0:2]:
                            rigandingwei_index = i
                    elif len(tianpanpanbieriganliebiao[1]) == 1:
                        if riganzhi == tianpanpanbieriganliebiao[0][0:2]:
                            rigandingwei_index = i
                    else:
                        if riganzhi == tianpanpanbieriganliebiao[0][0:2] or riganzhi == tianpanpanbieriganliebiao[1][
                                                                                        0:2]:
                            rigandingwei_index = i
            else:
                if len(tianpanpanbierigan) == 1:
                    if riganzhi[0] == tianpanpanbierigan:
                        rigandingwei_index = i
                elif len(tianpanpanbierigan) == 3:
                    if riganzhi[0] == tianpanpanbierigan[-1]:
                        rigandingwei_index = i
                else:
                    tianpanpanbieriganliebiao = tianpanpanbierigan.split("\n")
                    if riganzhi[0] == tianpanpanbieriganliebiao[0][-1] or riganzhi[0] == tianpanpanbieriganliebiao[1][
                        -1]:
                        rigandingwei_index = i
    # 时干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieshichenggan = ninegridsbasicmessage[i]["天盘"]
            if shichengganzhi[0] == "甲":
                if len(tianpanpanbieshichenggan) == 1:
                    pass
                elif len(tianpanpanbieshichenggan) == 3:
                    if shichengganzhi == tianpanpanbieshichenggan[0:2]:
                        shichenggandingwei_index = i
                else:
                    tianpanpanbieshichengganliebiao = tianpanpanbieshichenggan.split("\n")
                    if len(tianpanpanbieshichengganliebiao[0]) == 1:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[1][0:2]:
                            shichenggandingwei_index = i
                    elif len(tianpanpanbieshichengganliebiao[1]) == 1:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[0][0:2]:
                            shichenggandingwei_index = i
                    else:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[0][0:2] or shichengganzhi == \
                                tianpanpanbieshichengganliebiao[1][0:2]:
                            shichenggandingwei_index = i
            else:
                if len(tianpanpanbieshichenggan) == 1:
                    if shichengganzhi[0] == tianpanpanbieshichenggan:
                        shichenggandingwei_index = i
                elif len(tianpanpanbieshichenggan) == 3:
                    if shichengganzhi[0] == tianpanpanbieshichenggan[-1]:
                        shichenggandingwei_index = i
                else:
                    tianpanpanbieshichengganliebiao = tianpanpanbieshichenggan.split("\n")
                    if shichengganzhi[0] == tianpanpanbieshichengganliebiao[0][-1] or shichengganzhi[0] == \
                            tianpanpanbieshichengganliebiao[1][-1]:
                        shichenggandingwei_index = i
    tongbianbayaosu = [zhifugongdingwei_index, zhishigongdingwei_index, niangandingwei_index, yuegandingwei_index,
                       rigandingwei_index, shichenggandingwei_index, shengmendingwei_index, jiaziwudingwei_index]
    # 六十甲子+空亡
    list1jiazi = ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申",
                  "癸酉", "戌亥"]
    list2jiaxu = ["甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午",
                  "癸未", "申酉"]
    list3jiashen = ["甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰",
                    "癸巳", "午未"]
    list4jiawu = ["甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅",
                  "癸卯", "辰巳"]
    list5jiachen = ["甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子",
                    "癸丑", "寅卯"]
    list6jiayin = ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌",
                   "癸亥", "子丑"]
    listliushijiazi = [list1jiazi, list2jiaxu, list3jiashen, list4jiawu, list5jiachen, list6jiayin]
    gongshengxiaoduiying = {0: "子", 1: "未申", 2: "卯", 3: "辰巳", 5: "亥戌", 6: "酉", 7: "丑寅", 8: "午"}
    # 日干空
    for i in listliushijiazi:
        for j in i:
            if riganzhi == j:
                rikongzifuchuang = i[-1]
                fshibierigan = i
                break
            else:
                pass
    # 时干空
    for i in listliushijiazi:
        for j in i:
            if shichengganzhi == j:
                shikongzifuchuang = i[-1]
                fshibieshigan = i
                break
            else:
                pass
    kongwanglist = []
    for i in rikongzifuchuang:
        kongwanglist.append(i)
    for i in shikongzifuchuang:
        kongwanglist.append(i)
    if BIAN == 0:
        Panbietongbianlist = zuocegonghao
    elif BIAN == 1:
        Panbietongbianlist = youcegonghao
    tongbianjici = 0
    TONGBIANKONGWANGSHU = 0
    for i in range(0, 8):
        if tongbianbayaosu[i] in Panbietongbianlist:
            tongbianshengxiaodizhi = gongshengxiaoduiying[tongbianbayaosu[i]]
            for j in kongwanglist:
                if j in tongbianshengxiaodizhi:
                    TONGBIANKONGWANGSHU = TONGBIANKONGWANGSHU + 1
                else:
                    pass
            tongbianjici = tongbianjici + 1
    zhishigongshengxiaodizhi = gongshengxiaoduiying[zhishigongdingwei_index]
    KONGWANGSHU = 0
    for i in kongwanglist:
        if i in zhishigongshengxiaodizhi:
            KONGWANGSHU = KONGWANGSHU + 1
        else:
            pass
    zhishigongtianpan = ninegridsbasicmessage[zhishigongdingwei_index]["天盘"]
    # 1.4驿马落用神宫
    Yimadist = {"申子辰": "寅", "亥卯未": "巳", "寅午戌": "申", "巳酉丑": "亥"}
    for key in Yimadist:
        if shichengganzhi[1] in key:
            yima = Yimadist[key]
            break
        else:
            pass
    for key in gongshengxiaoduiying:
        if yima in gongshengxiaoduiying[key]:
            yimagonghao = key
    for key in Yimadist:
        if riganzhi[1] in key:
            yimari = Yimadist[key]
            break
        else:
            pass
    for key in gongshengxiaoduiying:
        if yimari in gongshengxiaoduiying[key]:
            yimarigonghao = key
    for key in Yimadist:
        if yueganzhi[1] in key:
            yimayue = Yimadist[key]
            break
        else:
            pass
    for key in gongshengxiaoduiying:
        if yimayue in gongshengxiaoduiying[key]:
            yimayuegonghao = key
    chongyongshenggonglist = {7: 1, 3: 5, 1: 7, 5: 3}
    yimachushi=SpaDigiX_APPONE_Value
    if yimagonghao == zhishigongdingwei_index and yimarigonghao == zhishigongdingwei_index and yimayuegonghao == zhishigongdingwei_index:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 3
        print(f"时日月三驿马落用神宫--->{-3}")
    elif yimagonghao == zhishigongdingwei_index and yimarigonghao == zhishigongdingwei_index:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + -2
        print(f"时日两驿马落用神宫--->{-2}")
    elif yimagonghao == zhishigongdingwei_index:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yimaluoyongshengong
        print(f"时驿马落用神宫--->{yimaluoyongshengong}")
    elif yimagonghao != zhishigongdingwei_index:
        if zhishigongdingwei_index == 7 or zhishigongdingwei_index == 3 or zhishigongdingwei_index == 1 or zhishigongdingwei_index == 5:
            if yimagonghao == chongyongshenggonglist[zhishigongdingwei_index]:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yimachongyongshengong
                if yimachongyongshengong >= 0:
                    yimachongyongshengong = f"+{yimachongyongshengong}"
                print(f"驿马冲用神宫--->{yimachongyongshengong}")
    # 同边要素规则
    tongbianyaosuchushi=SpaDigiX_APPONE_Value
    yimazuizhong=SpaDigiX_APPONE_Value-yimachushi
    ccccc = SpaDigiX_APPONE_Value
    tonggongjici = 0
    tonggongbayaosudingwei = [zhishigongdingwei_index, zhifugongdingwei_index, shengmendingwei_index,
                              shichenggandingwei_index, rigandingwei_index, yuegandingwei_index, niangandingwei_index,
                              jiaziwudingwei_index]
    for i in range(0, 8):
        if tonggongbayaosudingwei[i] == zhishigongdingwei_index:
            tonggongjici = tonggongjici + 1
    if tongbianjici == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yitong
    elif tongbianjici == 2:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + ertong
    elif tongbianjici == 4:
        if tonggongjici == 4:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + sitongqietonggong
    elif tongbianjici == 5:
        if tonggongjici == 5:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wutongqietonggong
    elif tongbianjici == 6:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + liutong
    elif tongbianjici == 7:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + qitong
    elif tongbianjici == 8:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + batong
    print(f"同边要素：{SpaDigiX_APPONE_Value - ccccc}")
    tongbianyaosuzuizhong=SpaDigiX_APPONE_Value-tongbianyaosuchushi
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.5用神宫空亡
    kongwangchushi=SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    if KONGWANGSHU == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongdankong
        print(f"用神宫单空--->{yongshengongdankong}")
    elif KONGWANGSHU == 2:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongshuangkong
        print(f"用神宫双空--->{yongshengongshuangkong}")
    elif KONGWANGSHU == 4:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongsikong
        print(f"用神宫四空--->{yongshengongsikong}")
    else:
        print("用神宫没有空亡情况")
    kongwangzuizhong=SpaDigiX_APPONE_Value-kongwangchushi
    # 支冲
    zhichongchushi=SpaDigiX_APPONE_Value
    zhichongchushi = SpaDigiX_APPONE_Value
    zhishigongtianpanshuju = ninegridsbasicmessage[zhishigongdingwei_index]["天盘"]
    zhishigongdipanshuju = ninegridsbasicmessage[zhishigongdingwei_index]["地盘"]
    zhichongonelist = ["甲子戊", "甲午辛"]
    zhichongtwolist = ["甲寅癸", "甲申庚"]
    zhichongthreelist = ["甲辰壬", "甲戌己"]
    if len(zhishigongtianpanshuju) == 3 and len(zhishigongdipanshuju) == 3:
        if zhishigongtianpanshuju == zhishigongdipanshuju:
            ccccccc = 0
        elif zhishigongtianpanshuju in zhichongonelist and zhishigongdipanshuju in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshuju in zhichongtwolist and zhishigongdipanshuju in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshuju in zhichongthreelist and zhishigongdipanshuju in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    elif len(zhishigongtianpanshuju) > 3 and len(zhishigongdipanshuju) == 3:
        zhishigongtianpanshujulist = zhishigongtianpanshuju.split("\n")
        if (zhishigongtianpanshujulist[0] in zhichongonelist or zhishigongtianpanshujulist[
            1] in zhichongonelist) and zhishigongdipanshuju in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif (zhishigongtianpanshujulist[0] in zhichongtwolist or zhishigongtianpanshujulist[
            1] in zhichongtwolist) and zhishigongdipanshuju in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif (zhishigongtianpanshujulist[0] in zhichongthreelist or zhishigongtianpanshujulist[
            1] in zhichongthreelist) and zhishigongdipanshuju in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if zhishigongtianpanshujulist[0] in zhichongonelist and zhishigongtianpanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongtwolist and zhishigongtianpanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongthreelist and zhishigongtianpanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    elif len(zhishigongtianpanshuju) == 3 and len(zhishigongdipanshuju) > 3:
        zhishigongdipanshujulist = zhishigongdipanshuju.split("\n")
        if zhishigongtianpanshuju in zhichongonelist and (
                zhishigongdipanshujulist[0] in zhichongonelist or zhishigongdipanshujulist[1] in zhichongonelist):
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshuju in zhichongtwolist and (
                zhishigongdipanshujulist[0] in zhichongtwolist or zhishigongdipanshujulist[1] in zhichongtwolist):
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshuju in zhichongthreelist and (
                zhishigongdipanshujulist[0] in zhichongthreelist or zhishigongdipanshujulist[1] in zhichongthreelist):
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if zhishigongdipanshujulist[0] in zhichongonelist and zhishigongdipanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongtwolist and zhishigongdipanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongthreelist and zhishigongdipanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    elif len(zhishigongtianpanshuju) > 3 and len(zhishigongdipanshuju) > 3:
        zhishigongtianpanshujulist = zhishigongtianpanshuju.split("\n")
        zhishigongdipanshujulist = zhishigongdipanshuju.split("\n")
        if zhishigongtianpanshuju == zhishigongdipanshuju:
            if zhishigongdipanshujulist[0] in zhichongonelist and zhishigongdipanshujulist[1] in zhichongonelist:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
            elif zhishigongdipanshujulist[0] in zhichongtwolist and zhishigongdipanshujulist[1] in zhichongtwolist:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
            elif zhishigongdipanshujulist[0] in zhichongthreelist and zhishigongdipanshujulist[1] in zhichongthreelist:
                if riganzhi == "甲子":
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                else:
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
            if zhishigongtianpanshujulist[0] in zhichongonelist and zhishigongtianpanshujulist[1] in zhichongonelist:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
            elif zhishigongtianpanshujulist[0] in zhichongtwolist and zhishigongtianpanshujulist[1] in zhichongtwolist:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
            elif zhishigongtianpanshujulist[0] in zhichongthreelist and zhishigongtianpanshujulist[
                1] in zhichongthreelist:
                if riganzhi == "甲子":
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                else:
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if (zhishigongtianpanshujulist[0] in zhichongonelist or zhishigongtianpanshujulist[
            1] in zhichongonelist) and (
                zhishigongdipanshujulist[0] in zhichongonelist or zhishigongdipanshujulist[1] in zhichongonelist):
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if (zhishigongtianpanshujulist[0] in zhichongtwolist or zhishigongtianpanshujulist[1] in zhichongtwolist) and (
                zhishigongdipanshujulist[0] in zhichongtwolist or zhishigongdipanshujulist[1] in zhichongtwolist):
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if (zhishigongtianpanshujulist[0] in zhichongthreelist or zhishigongtianpanshujulist[
            1] in zhichongthreelist) and (
                zhishigongdipanshujulist[0] in zhichongtwolist or zhishigongdipanshujulist[1] in zhichongthreelist):
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if zhishigongdipanshujulist[0] in zhichongonelist and zhishigongdipanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongtwolist and zhishigongdipanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongthreelist and zhishigongdipanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        if zhishigongtianpanshujulist[0] in zhichongonelist and zhishigongtianpanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongtwolist and zhishigongtianpanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongthreelist and zhishigongtianpanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    elif len(zhishigongtianpanshuju) == 1 and len(zhishigongdipanshuju) > 3:
        zhishigongdipanshujulist = zhishigongdipanshuju.split("\n")
        if zhishigongdipanshujulist[0] in zhichongonelist and zhishigongdipanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongtwolist and zhishigongdipanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongdipanshujulist[0] in zhichongthreelist and zhishigongdipanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    elif len(zhishigongtianpanshuju) > 3 and len(zhishigongdipanshuju) == 1:
        zhishigongtianpanshujulist = zhishigongtianpanshuju.split("\n")
        if zhishigongtianpanshujulist[0] in zhichongonelist and zhishigongtianpanshujulist[1] in zhichongonelist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongtwolist and zhishigongtianpanshujulist[1] in zhichongtwolist:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
        elif zhishigongtianpanshujulist[0] in zhichongthreelist and zhishigongtianpanshujulist[1] in zhichongthreelist:
            if riganzhi == "甲子":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhichongone
    zhichongzuizhong = SpaDigiX_APPONE_Value - zhichongchushi
    if zhichongzuizhong > 2:
        chaochuxiuzheng = zhichongzuizhong - 2
        zhichongzuizhong = 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - chaochuxiuzheng

    print(f"支冲：{zhichongzuizhong}")
    zhichongzuizhong=SpaDigiX_APPONE_Value-zhichongchushi
    # 增加规则
    # 1.6伏吟
    quanfu = 2
    zhifu = 1
    menfu = 1
    # -----------------------------------------------------------------------------------------------------------------------
    fuyingchushi=SpaDigiX_APPONE_Value
    # 全伏
    kunergongshuju = ninegridsbasicmessage[1]
    if kunergongshuju["天盘"] == kunergongshuju["地盘"] and (
            kunergongshuju["八门"] == "死" or kunergongshuju["八门"] == "死使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + quanfu
        print(f"全伏:{quanfu}")
    elif kunergongshuju["天盘"] == kunergongshuju["地盘"] and kunergongshuju["八门"] != "死" and kunergongshuju[
        "八门"] != "死使":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhifu
        print(f"值伏:{zhifu}")
    elif kunergongshuju["天盘"] != kunergongshuju["地盘"] and (
            kunergongshuju["八门"] == "死" or kunergongshuju["八门"] == "死使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + menfu
        print(f"门伏:{menfu}")
    fuyingzuizhong=SpaDigiX_APPONE_Value-fuyingchushi
    # -----------------------------------------------------------------------------------------------------------------------
    # 反吟
    fanyingchushi=SpaDigiX_APPONE_Value
    quanfan = -1
    zhifan = -1
    menfan = -1
    genbagongshuju = ninegridsbasicmessage[7]
    if kunergongshuju["天盘"] == genbagongshuju["地盘"] and (
            kunergongshuju["八门"] == "生" or kunergongshuju["八门"] == "生使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + quanfan
        print(f"全反:{quanfan}")
    elif kunergongshuju["天盘"] != genbagongshuju["地盘"] and (
            kunergongshuju["八门"] == "生" or kunergongshuju["八门"] == "生使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + menfan
        print(f"门反:{menfan}")
    elif kunergongshuju["天盘"] == genbagongshuju["地盘"] and kunergongshuju["八门"] != "生" and kunergongshuju[
        "八门"] != "生使":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhifan
        print(f"值反:{zhifan}")
    fanyingzuizhong=SpaDigiX_APPONE_Value-fanyingchushi
    jiaziwusanjimenchushi=SpaDigiX_APPONE_Value
    jimen = ["开", "休", "生"]
    zhishigongshuju = ninegridsbasicmessage[zhishigongdingwei_index]
    zhishigongbamen = zhishigongshuju["八门"]
    if zhishigongtianpan == "甲子戊" and zhishigongbamen[0] in jimen:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
        print("甲子戊+三吉门：-1")
    # 甲子日+1。
    if riganzhi == "甲子":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
        print(f"甲子日：{1}")

    # 月、日、时三癸(无附加条件情况下)干-1。
    if yueganzhi[0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
        print(f"三癸干：{-1}")
    quanpanchupanjieguo = SpaDigiX_APPONE_Value
    jiaziwusanjimenzuizhong=SpaDigiX_APPONE_Value-jiaziwusanjimenchushi

    # -----------------------------------------------------------------------------------------------------------------------
    quanpanchupanjieguo = SpaDigiX_APPONE_Value
    jixionggejishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    # 2 单宫部分（以值使做用神为例）
    print("----------------------------------------------------------------------------------------------------------")

    def getjixiongge(SpaDigiX_APPONE_Value, zhishigongtianpan, zhishigongdipan):
        zhishigongshuju = ninegridsbasicmessage[zhishigongdingwei_index]  # 读取值使所在宫的数据
        # -----------------------------------------------------------------------------------------------------------------------
        # 2.1 吉格
        # -----------------------------------------------------------------------------------------------------------------------
        # 戊＋丙
        zhishigongtianpan = zhishigongtianpan
        zhishigongtianpanjishu = 0
        zhishigongdipan = zhishigongdipan
        zhishigongdipanjishu = 0
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wubing
        # 丙＋戊
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingwu
        zhishigongbamen = zhishigongshuju["八门"]
        zhishigongbamenjishu = 0
        zhishigongbashen = zhishigongshuju["八神"]
        zhishigongbashenjishu = 0
        zhishigonggonghaojishu = 0

        # -----------------------------------------------------------------------------------------------------------------------
        # -----------------------------------------------------------------------------------------------------------------------
        # 三奇得使
        # 丁+甲辰壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingjiachen
        # 2.4 三诈
        # 乙、丙、丁（开门）十神盘（太阴）
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[
                0] == "丙" or \
                    zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
                1] == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if zhishigongbamen == "开使":
            zhishigongbamenjishu = 1
        else:
            zhishigongbamenjishu = 0
        if zhishigongbashen == "太阴":
            zhishigongbashenjishu = 1
        else:
            zhishigongbashenjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_kai_taiyin
        # 乙、丙、丁（休门）十神盘（九地）
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[
                0] == "丙" or \
                    zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
                1] == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if zhishigongbamen == "休使":
            zhishigongbamenjishu = 1
        else:
            zhishigongbamenjishu = 0
        if zhishigongbashen == "九地":
            zhishigongbashenjishu = 1
        else:
            zhishigongbashenjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_xiu_jiudi
        # 乙、丙、丁（生门）十神盘（六合）
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[
                0] == "丙" or \
                    zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
                1] == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if zhishigongbamen == "生使":
            zhishigongbamenjishu = 1
        else:
            zhishigongbamenjishu = 0
        if zhishigongbashen == "六合":
            zhishigongbashenjishu = 1
        else:
            zhishigongbashenjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_sheng_liuhe
        # 2.8 交泰格、天运格。-1
        # 丁十丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingbing
        # 丁十乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingyi

        # 2.10 凶格
        # 庚十丙+3
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            agengbing = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengbing
        else:
            agengbing = 0
        # 丙十庚+3
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + binggeng
        # 辛十乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinyi

        # 丁十癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丁" and yueganzhi[
            0] == "丁" and riganzhi[0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丁" and riganzhi[
            0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丁" and shichengganzhi[
            0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dinggui

        # 六甲值符十庚 改为甲子戊+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwugeng

        # 2.11 其他凶格
        # 刑格 庚+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            xingge = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengji
        else:
            xingge = 0

        # 大格 庚+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            dage = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + genggui
        else:
            dage = 0

        # 小格 庚+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            xiaoge = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengren
        else:
            xiaoge = 0

        # 岁格 庚 +年干
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        niangan = nianganzhi[0]
        zhishigongdipangan1 = zhishigongdipan
        zhishigongdipangan2 = zhishigongdipan
        if len(zhishigongdipan) == 1:
            if niangan == zhishigongdipan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "甲"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            if zhishigongdipangan == niangan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 == zhishigongdipanlist[0]
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "甲"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[-1]
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 == zhishigongdipanlist[1]
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "甲"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[-1]
            if zhishigongdipangan1 == niangan or zhishigongdipangan2 == niangan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            suige = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengniangan
        else:
            suige = 0
        #  月格 庚+月干
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        yuegan = yueganzhi[0]
        zhishigongdipangan1 = zhishigongdipan
        zhishigongdipangan2 = zhishigongdipan
        if len(zhishigongdipan) == 1:
            if yuegan == zhishigongdipan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            if zhishigongdipangan == yuegan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 == zhishigongdipanlist[0]
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[-1]
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 == zhishigongdipanlist[1]
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[-1]
            if zhishigongdipangan1 == yuegan or zhishigongdipangan2 == yuegan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            yuege = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengyuegan
        else:
            yuege = 0
        # 日格 庚+日干
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        rigan = riganzhi[0]
        zhishigongdipangan1 = zhishigongdipan
        zhishigongdipangan2 = zhishigongdipan
        if len(zhishigongdipan) == 1:
            if rigan == zhishigongdipan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            if zhishigongdipangan == rigan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 == zhishigongdipanlist[0]
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[-1]
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 == zhishigongdipanlist[1]
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[-1]
            if zhishigongdipangan1 == rigan or zhishigongdipangan2 == rigan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            rige = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengrigan
        else:
            rige = 0
        # 时格 庚+时干
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        shichenggan = shichengganzhi[0]
        zhishigongdipangan1 = zhishigongdipan
        zhishigongdipangan2 = zhishigongdipan
        if len(zhishigongdipan) == 1:
            if shichenggan == zhishigongdipan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            if zhishigongdipangan == shichenggan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 == zhishigongdipanlist[0]
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[-1]
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 == zhishigongdipanlist[1]
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[-1]
            if zhishigongdipangan1 == shichenggan or zhishigongdipangan2 == shichenggan:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            shige = 1
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengshigan
        else:
            shige = 0
        gegegege = [suige, yuege, rige, shige]
        gegegegejishu = 0
        gegegan = ["丙", "己", "癸", "壬"]
        for i in range(0, 4):
            if gegegege[i] == 1:
                gegegegejishu = gegegegejishu + 1
        if (agengbing == 1 or xingge == 1 or dage == 1 or xiaoge == 1) and (
                niangan in gegegan or yuegan in gegegan or rigan in gegegan or shichenggan in gegegan):
            if gegegegejishu > 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2 * (gegegegejishu - 1)
        # 飞干格 日干+庚
        rigan = riganzhi[0]
        zhishigongtianpangan1 = zhishigongtianpan
        zhishigongtianpangan2 = zhishigongtianpan
        if len(zhishigongtianpan) == 1:
            if rigan == zhishigongtianpan:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan = "戊"
                else:
                    zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = zhishigongtianpan[-1]
            if zhishigongtianpangan == rigan:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpangan1 == zhishigongtianpanlist[0]
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpangan1 = "戊"
                    else:
                        zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = zhishigongtianpanlist[-1]
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpangan2 == zhishigongtianpanlist[1]
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpangan2 = "戊"
                    else:
                        zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = zhishigongtianpanlist[-1]
            if zhishigongtianpangan1 == rigan or zhishigongtianpangan2 == rigan:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0

        if zhishigongdipanjishu == 1 and zhishigongtianpanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rigangeng
        # 2.14 奇格
        # 庚+乙、丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙" or zhishigongdipanlist[0] == "丁" or \
                    zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙" or zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "庚" and yueganzhi[
            0] == "庚" and riganzhi[0] == "庚" and shichengganzhi[0] == "庚":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "庚" and riganzhi[
            0] == "庚" and shichengganzhi[0] == "庚":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "庚" and shichengganzhi[
            0] == "庚":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengyiorbingording
        # 2.15 天网
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guigui
        # 其他格
        jimen = ["开使", "休使", "生使"]
        xiongmen = ["死使", "惊使", "伤使", "杜使"]
        qitamen = ["死使", "惊使", "伤使", "杜使", "景使"]
        xiongxin = ["天蓬", "天芮", "天柱"]
        menpo = {"惊使": "23", "开使": "23", "休使": "8", "生使": "0", "死使": "0", "景使": "56", "杜使": "17",
                 "伤使": "17"}
        gongpo = {6: ["杜使", "伤使"], 5: ["杜使", "伤使"], 0: ["景使"], 7: ["休使"], 1: ["休使"], 8: ["惊使", "开使"],
                  3: ["生使", "死使"], 2: ["生使", "死使"]}
        mengongxiangshen = {"惊使": "17", "开使": "17", "休使": "56", "生使": "8", "死使": "8", "景使": "23",
                            "杜使": "0",
                            "伤使": "0"}
        # 2.17.2 乙
        # 乙+甲
        zhishigongdipanjishu1 = 0
        zhishigongdipanjishu2 = 0
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 0
                else:
                    zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 0
                    else:
                        zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 0
                    else:
                        zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yijia
        # 乙+乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiyi
        # 乙+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        zhishigongjiuxin = zhishigongshuju["九星"]
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yibing

        # 乙+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiding

        # 乙+戊
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 1
                else:
                    zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 1
                    else:
                        zhishigongdipanjishu1 = 1
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 1
                    else:
                        zhishigongdipanjishu2 = 1
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongbamen in xiongmen:
            bamenxiongjishu = 1
        else:
            bamenxiongjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiwu

        # 乙＋辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "乙" and yueganzhi[
            0] == "乙" and riganzhi[0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "乙" and riganzhi[
            0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "乙" and shichengganzhi[
            0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_qita
        # 乙+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "乙" and yueganzhi[
            0] == "乙" and riganzhi[0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "乙" and riganzhi[
            0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "乙" and shichengganzhi[
            0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiren_xiongmen
        # 乙+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "乙" and yueganzhi[
            0] == "乙" and riganzhi[0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "乙" and riganzhi[
            0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "乙" and shichengganzhi[
            0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigeng_qita
        # 乙+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "乙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "乙" and yueganzhi[
            0] == "乙" and riganzhi[0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "乙" and riganzhi[
            0] == "乙" and shichengganzhi[0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "乙" and shichengganzhi[
            0] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigui_qita
        # 2.17.3 丙
        # 丙+乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingyi
        # 丙+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丙" and yueganzhi[
            0] == "丙" and riganzhi[0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丙" and riganzhi[
            0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丙" and shichengganzhi[
            0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingbing

        # 丙+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingding
        # 丙+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丙" and yueganzhi[
            0] == "丙" and riganzhi[0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丙" and riganzhi[
            0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丙" and shichengganzhi[
            0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingxin
        # 丙+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丙" and yueganzhi[
            0] == "丙" and riganzhi[0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丙" and riganzhi[
            0] == "丙" and shichengganzhi[0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丙" and shichengganzhi[
            0] == "丙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingren
        # 丙+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丙":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + binggui
        # 2.17.4 丁
        # 丁+甲
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 0
                else:
                    zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 0
                    else:
                        zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 0
                    else:
                        zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingjia
        # 丁+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingding
        # 丁+戊
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0

        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 1
                else:
                    zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 1
                    else:
                        zhishigongdipanjishu1 = 1
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 1
                    else:
                        zhishigongdipanjishu2 = 1
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingwu
        # 丁+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丁" and yueganzhi[
            0] == "丁" and riganzhi[0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丁" and riganzhi[
            0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丁" and shichengganzhi[
            0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingji
        # 丁+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丁" and yueganzhi[
            0] == "丁" and riganzhi[0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丁" and riganzhi[
            0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丁" and shichengganzhi[
            0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dinggeng
        # 丁+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpan) == 1:
            if zhishigongtianpan == "丁":
                zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        else:
            zhishigongtianpanjishu1 = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "丁" and yueganzhi[
            0] == "丁" and riganzhi[0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "丁" and riganzhi[
            0] == "丁" and shichengganzhi[0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "丁" and shichengganzhi[
            0] == "丁":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingxin
        # 2.17.5 戊

        # 戊+乙
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0
            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0

        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongbamen in jimen:
            bamenjilijishu = 1
        else:
            bamenjilijishu = 0
        if zhishigongbamen in xiongmen:
            bamenxiongjishu = 1
        else:
            bamenxiongjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuyi_xiongmen
        # 戊＋丁
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0
            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuding
        # 戊+戊
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu == 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0
            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuwu
        # 戊+辛
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0
            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongbashen in jimen:
            bamenjilijishu = 1
        else:
            bamenjilijishu = 0
        if zhishigongbashen in xiongmen:
            bamenxiongjishu = 1
        else:
            bamenxiongjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuxin_xiongmen
        # 戊+癸
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0
            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongbashen in jimen:
            bamenjilijishu = 1
        else:
            bamenjilijishu = 0
        if zhishigongbashen in xiongmen:
            bamenxiongjishu = 1
        else:
            bamenxiongjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwugui
        # 戊+壬
        if len(zhishigongtianpan) == 1:
            zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu = 1
                else:
                    zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanlist[0]) == 1:
                zhishigongtianpanjishu1 = 0
            elif len(zhishigongtianpanlist[0]) == 3:
                if zhishigongtianpanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu1 = 1
                    else:
                        zhishigongtianpanjishu1 = 1
                else:
                    zhishigongtianpanjishu1 = 0
            if len(zhishigongtianpanlist[1]) == 1:
                zhishigongtianpanjishu2 = 0
            elif len(zhishigongtianpanlist[1]) == 3:
                if zhishigongtianpanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpanjishu2 = 1
                    else:
                        zhishigongtianpanjishu2 = 1
                else:
                    zhishigongtianpanjishu2 = 0

            if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "戊" and yueganzhi[
            0] == "戊" and riganzhi[0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "戊" and riganzhi[
            0] == "戊" and shichengganzhi[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "戊" and shichengganzhi[
            0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuren

        # 2.17.6 己
        # 己+乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiyi
        # 己+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jibing
        # 己+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiding
        # 己+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiji
        # 己+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jigeng
        # 己+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jixin
        # 己+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiren

        # 己+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲戌己":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "己" and yueganzhi[
            0] == "己" and riganzhi[0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "己" and riganzhi[
            0] == "己" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "己" and shichengganzhi[
            0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jigui

        # 2.17.7 庚

        # 庚+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + genggeng
        # 庚+戊

        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengwu
        # 庚+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲申庚":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengxin

        # 2.17.8 辛

        # 辛+甲
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 0
                else:
                    zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 0
                    else:
                        zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 0
                    else:
                        zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 == 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinjia

        # 辛+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongbamen in jimen:
            bamenjilijishu = 1
        else:
            bamenjilijishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinbing_qita
        # 辛+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinding

        # 辛+戊
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 1
                else:
                    zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 1
                    else:
                        zhishigongdipanjishu1 = 1
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 1
                    else:
                        zhishigongdipanjishu2 = 1
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinwu

        # 辛+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinji
        # 辛+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xingeng

        # 辛+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinxin
        # 辛+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinren

        # 辛+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲午辛":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "辛" and yueganzhi[
            0] == "辛" and riganzhi[0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "辛" and riganzhi[
            0] == "辛" and shichengganzhi[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "辛" and shichengganzhi[
            0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xingui

        # 2.17.9  壬
        # 壬+乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renyi

        # 壬+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renbing
        # 壬+戊
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 1
                else:
                    zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 1
                    else:
                        zhishigongdipanjishu1 = 1
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 1
                    else:
                        zhishigongdipanjishu2 = 1
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renwu

        # 壬+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renji

        # 壬+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renxin
        # 壬+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rending
        # 壬+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rengeng
        # 壬+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renren
        # 壬+癸
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲辰壬":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲寅癸":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "壬" and yueganzhi[
            0] == "壬" and riganzhi[0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "壬" and riganzhi[
            0] == "壬" and shichengganzhi[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "壬" and shichengganzhi[
            0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rengui

        # 2.17.10 癸

        # 癸+甲
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0

        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 0
                else:
                    zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 0
                    else:
                        zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 0
                    else:
                        zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guijia

        # 癸+乙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "乙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongbamen in jimen:
            bamenjilijishu = 1
        else:
            bamenjilijishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiyi_qita

        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiyi_qita
        # 癸+丙
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丙":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guibing
        # 癸+丁
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 1:
            if zhishigongdipan == "丁":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiding

        # 癸+戊
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1

            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) == 1:
            zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu = 1
                else:
                    zhishigongdipanjishu = 1

            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipanjishu1 = 0
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu1 = 1
                    else:
                        zhishigongdipanjishu1 = 1
                else:
                    zhishigongdipanjishu1 = 0
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipanjishu2 = 0
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipanjishu2 = 1
                    else:
                        zhishigongdipanjishu2 = 1
                else:
                    zhishigongdipanjishu2 = 0
            if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0

        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and zhishigongbashen == "值符":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiwu_xiongmenpozhi
        # 癸+己
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲戌己":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiji
        # 癸+庚
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲申庚":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guigeng
        # 癸+辛
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲午辛":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guixin
        # 癸+壬
        if len(zhishigongtianpan) > 3:
            zhishigongtianpanlist = zhishigongtianpan.split("\n")
            if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲寅癸":
                zhishigongtianpanjishu = 1
            else:
                zhishigongtianpanjishu = 0
        else:
            zhishigongtianpanjishu = 0
        if len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲辰壬":
                zhishigongdipanjishu = 1
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
        if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and nianganzhi[0] == "癸" and yueganzhi[
            0] == "癸" and riganzhi[0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and yueganzhi[0] == "癸" and riganzhi[
            0] == "癸" and shichengganzhi[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 3
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and riganzhi[0] == "癸" and shichengganzhi[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
        elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiren
        return SpaDigiX_APPONE_Value

    zhishigongshuju = ninegridsbasicmessage[zhishigongdingwei_index]  # 读取值使所在宫的数据
    zhishigongtianpanpanduan = zhishigongshuju["天盘"]
    zhishigongdipanpanduan = zhishigongshuju["地盘"]
    if len(zhishigongtianpanpanduan) > 3 and len(zhishigongdipanpanduan) > 3:
        zhishigongtianpanshurulist = zhishigongtianpanpanduan.split("\n")
        zhishigongdipanshurulist = zhishigongdipanpanduan.split("\n")
        SS = getjixiongge(SpaDigiX_APPONE_Value, zhishigongtianpanshurulist[0], zhishigongdipanshurulist[0])
        SpaDigiX_APPONE_Value = SS
        SS = getjixiongge(SpaDigiX_APPONE_Value, zhishigongtianpanshurulist[1], zhishigongdipanshurulist[1])
        SpaDigiX_APPONE_Value = SS
    else:
        SS = getjixiongge(SpaDigiX_APPONE_Value, zhishigongtianpanpanduan, zhishigongdipanpanduan)
        SpaDigiX_APPONE_Value = SS
    jixionggejishuzuizhong = SpaDigiX_APPONE_Value - jixionggejishuchushi
    print(f'2 吉凶格：{jixionggejishuzuizhong}')
    # -----------------------------------------------------------------------------------------------------------------------
    # 3 单宫天盘干定数
    print("----------------------------------------------------------------------------------------------------------")
    # 十二个月份各干定数
    zhishigongtianpan = zhishigongshuju["天盘"]
    zhishigongdipan = zhishigongshuju["地盘"]
    zhishigongbamen = zhishigongshuju["八门"]
    zhishigongjiuxing = zhishigongshuju["九星"]
    zhishigongbashen = zhishigongshuju["八神"]
    # -----------------------------------------------------------------------------------------------------------------------
    dangongtianpangandingshuchushi = SpaDigiX_APPONE_Value
    for key in month_dict_dangongtianpangandingshu:
        if key == yueganzhi[1]:
            yuefen = key
            yuefen_dangongtianpangandingshu = month_dict_dangongtianpangandingshu[key]
        else:
            pass
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in yuefen_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                shieryuefengegandingshu = yuefen_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in yuefen_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                shieryuefengegandingshu = yuefen_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        # 1
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    shieryuefengegandingshu1 = yuefen_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    shieryuefengegandingshu1 = yuefen_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    shieryuefengegandingshu2 = yuefen_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    shieryuefengegandingshu2 = yuefen_dangongtianpangandingshu[key]
        shieryuefengegandingshu = (shieryuefengegandingshu2 + shieryuefengegandingshu1) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    # 九宫各天盘干定数
    # -----------------------------------------------------------------------------------------------------------------------
    gongweixuhaoduiying = {0: "坎一宫", 1: "坤二宫", 2: "震三宫", 3: "巽四宫", 5: "乾六宫", 6: "兑七宫", 7: "艮八宫",
                           8: "离九宫"}
    for key in palace_dict_dangongtianpangandingshu:
        if key == zhishigongdingwei_index:
            gongming = gongweixuhaoduiying[key]
            gongwei_dangongtianpangandingshu = palace_dict_dangongtianpangandingshu[key]
        else:
            pass
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in gongwei_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                jiugonggetianpangandingshu = gongwei_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in gongwei_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                jiugonggetianpangandingshu = gongwei_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        # 1
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    jiugonggetianpangandingshu1 = gongwei_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    jiugonggetianpangandingshu1 = gongwei_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    jiugonggetianpangandingshu2 = gongwei_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    jiugonggetianpangandingshu2 = gongwei_dangongtianpangandingshu[key]
        jiugonggetianpangandingshu = (jiugonggetianpangandingshu2 + jiugonggetianpangandingshu1) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 天盘干与地盘干五行力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                tianpandingwei_dipan_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
            tiandiwuxingliliangxiaozhangdingshu = (
                                                              tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu2) / 2
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianoangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                tianpandingwei_dipan_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
            tiandiwuxingliliangxiaozhangdingshu = (
                                                              tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu2) / 2
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan1 == key:
                tianpandingwei_dipan2_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                else:
                    pass
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan2_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan2 == key:
                tianpandingwei_dipan3_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass

        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                else:
                    pass
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu4 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu4 = tianpandingwei_dipan3_dangongtianpangandingshu[key]

        try:
            # 尝试获取变量的值
            variable_value = zhishigongdipangan
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + (
                        tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu3) / 2
        except NameError:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + (
                    tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu3) / 2
    dangongtianpangandingshuzuizhong = SpaDigiX_APPONE_Value - dangongtianpangandingshuchushi
    print(f"3 单宫天盘干定数：{dangongtianpangandingshuzuizhong}")
    # 4 单宫九星力量消长定数
    print("----------------------------------------------------------------------------------------------------------")
    dangongjiuxingliliangjishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    jixing = ["天辅", "天禽", "天心", "天任"]
    xiongxing = ["天蓬", "天芮", "天柱"]
    # 十二月各星力量
    zhishigongjiuxing = zhishigongshuju["九星"]
    # 特殊情况
    if zhishigongjiuxing == "天蓬" and zhishigongdingwei_index == 8 and (yueganzhi[1] == "巳" or yueganzhi[1] == "午"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
    elif (
            zhishigongjiuxing == "天芮" or zhishigongjiuxing == "天禽" or zhishigongjiuxing == "天任") and zhishigongdingwei_index == 0 and (
            yueganzhi[1] == "子" or yueganzhi[1] == "亥"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
    elif (zhishigongjiuxing == "天冲" or zhishigongjiuxing == "天辅") and (
            zhishigongdingwei_index == 1 or zhishigongdingwei_index == 7) and (
            yueganzhi[1] == "丑" or yueganzhi[1] == "辰" or yueganzhi[1] == "未" or yueganzhi[1] == "戌"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
    elif (zhishigongjiuxing == "天心" or zhishigongjiuxing == "天柱") and (
            zhishigongdingwei_index == 2 or zhishigongdingwei_index == 3) and (
            yueganzhi[1] == "寅" or yueganzhi[1] == "卯"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
    elif zhishigongjiuxing == "天英" and (zhishigongdingwei_index == 6 or zhishigongdingwei_index == 5) and (
            yueganzhi[1] == "申" or yueganzhi[1] == "酉"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
    else:
        # 各星力量

        for key in yuefenduiyingjiuxingliliang:
            if yueganzhi[1] == key:
                yuefenduiyingjiuxingliliang_benyuelist = yuefenduiyingjiuxingliliang[key]
        jiuxinggeyueliliangdingshu = yuefenduiyingjiuxingliliang_benyuelist[zhishigongjiuxing]
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxinggeyueliliangdingshu
        # -----------------------------------------------------------------------------------------------------------------------
        # 4.2 九宫各星力量
        # -----------------------------------------------------------------------------------------------------------------------
        # 九宫各星力量数据
        zhishiduiyinggongjiuxingdist = jiugonggexingliliangshuju[zhishigongdingwei_index]
        zhishigongduiyingjiuxingliliangdingshu = zhishiduiyinggongjiuxingdist[zhishigongjiuxing]
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhishigongduiyingjiuxingliliangdingshu
    dangongjiuxingliliangjishuzuizhong = SpaDigiX_APPONE_Value - dangongjiuxingliliangjishuchushi
    print(f"4 单宫九星力量消长定数：{dangongjiuxingliliangjishuzuizhong}")
    # -----------------------------------------------------------------------------------------------------------------------
    # 5 单宫八门力量消长
    print("----------------------------------------------------------------------------------------------------------")
    dangongbamenliliangjishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.1 八门在十二个月的力量
    dangyuebamenzidian = bamenshieryueshuju[yueganzhi[1]]
    bamengeyueliliangdingshu = dangyuebamenzidian[zhishigongbamen[0]]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamengeyueliliangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.2 八门在九宫中的力量消长
    # -----------------------------------------------------------------------------------------------------------------------
    zhishigongduiyingmenzidian = bamenjiugongliliangxiaozhangshuju[zhishigongdingwei_index]
    bamenjiugongliliangxiaozhangdingshu = zhishigongduiyingmenzidian[zhishigongbamen[0]]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamenjiugongliliangxiaozhangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 八门与天盘干关系
    bamentianpanganguanxishuju = {
        "乙": {"开": 0, "休": -1, "生": 0, "伤": -1, "杜": -1, "景": 0, "死": 1, "惊": 1},
        "丙": {"开": 0, "休": 0, "生": 0, "伤": -1, "杜": -1, "景": -1, "死": 0, "惊": 1},
        "丁": {"开": 0, "休": 0, "生": 0, "伤": -1, "杜": -1, "景": -1, "死": 0, "惊": 1},
        "戊": {"开": 0, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 0},
        "己": {"开": 0, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 0},
        "庚": {"开": -1, "休": 0, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "辛": {"开": -1, "休": 0, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "壬": {"开": -1, "休": -1, "生": 1, "伤": 0, "杜": 0, "景": 1, "死": 1, "惊": -1},
        "癸": {"开": -1, "休": -1, "生": 1, "伤": 0, "杜": 0, "景": 1, "死": 1, "惊": -1}
    }
    if len(zhishigongtianpan) == 1 or len(zhishigongtianpan) == 3:
        for key in bamentianpanganguanxishuju:
            if zhishigongtianpan[-1] == key:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpanganguanxishuju[key][zhishigongbamen[0]]
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        for key in bamentianpanganguanxishuju:
            if zhishigongtianpanlist[0][-1] == key:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpanganguanxishuju[key][zhishigongbamen[0]] / 2
        for key in bamentianpanganguanxishuju:
            if zhishigongtianpanlist[1][-1] == key:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpanganguanxishuju[key][zhishigongbamen[0]] / 2
    dangongbamenliliangjishuzuizhong = SpaDigiX_APPONE_Value - dangongbamenliliangjishuchushi
    print(f"5 单宫八门力量消长定数：{dangongbamenliliangjishuzuizhong}")
    # -----------------------------------------------------------------------------------------------------------------------
    # 6 八神单宫力量消长定数
    print("----------------------------------------------------------------------------------------------------------")
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.1十二个月八神力量消长
    # -----------------------------------------------------------------------------------------------------------------------
    dangongbashenliliangjishuchushi = SpaDigiX_APPONE_Value
    dangyuebashenzidian = bashenshieryueliliangxiaozhangshuju[yueganzhi[1]]
    bashendangyueliliangxiaozhangdingshu = dangyuebashenzidian[zhishigongbashen]
    if zhishigongbashen == "值符" and (
            yueganzhi[1] == "丑" or yueganzhi[1] == "辰" or yueganzhi[1] == "未" or yueganzhi[1] == "戌") and (
            zhishigongdingwei_index == 1 or zhishigongdingwei_index == 7):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value
    else:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bashendangyueliliangxiaozhangdingshu
        # 6.2 八神在九宫内力量消长
        # -----------------------------------------------------------------------------------------------------------------------
        zhishigongbashenzidian = bashenzaijiugongliliangxiaozhangshuju[zhishigongdingwei_index]
        bashendanggongdingshu = zhishigongbashenzidian[zhishigongbashen]
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bashendanggongdingshu
    dangongbashenliliangxiaozhangjishuzuizhong = SpaDigiX_APPONE_Value - dangongbashenliliangjishuchushi
    # -----------------------------------------------------------------------------------------------------------------------
    print(f"6 单宫八神力量消长定数：{dangongbashenliliangxiaozhangjishuzuizhong}")
    print("----------------------------------------------------------------------------------------------------------")
    changshengshiergongchushi = SpaDigiX_APPONE_Value
    changshenshiergongshuju = {
        '甲': [1, -1, -2, -1, -1, 1, 2, -1],
        '乙': [1, 1, -2, -1, -1, 1, 2, 2],
        '丙': [0, -1, -1, -2, -2, -1, 1, 2],
        '丁': [2, 1, -1, -2, -2, 1, -1, 0],
        '戊': [0, -1, 1, -1, -2, -1, 1, 2],
        '己': [0, 1, 1, -2, 0, 0, -1, 0],
        '庚': [1, 1, 2, -1, 2, -1, -2, -2],
        '辛': [-1, 1, 2, 1, 2, -1, -2, 0],
        '壬': [-2, -1, 1, 1, 1, -2, -1, -2],
        '癸': [-2, 1, -1, 1, 2, 1, -1, -2],
    }
    nigonghaoduiyingzidian = {0: 0, 1: 5, 2: 2, 3: 3, 5: 7, 6: 6, 7: 1, 8: 4}
    if len(zhishigongtianpan) == 1:
        for key in changshenshiergongshuju:
            if zhishigongtianpan == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    for i in range(0, 2):
                        zhishigongdipanlist.append(zhishigongdipanganlist[i][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    listll = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    listll = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                else:
                    listll = changshenshiergongshuju[key]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + listll_dingwei_index
    elif len(zhishigongtianpan) == 3:
        zhishigongtianpangan = zhishigongtianpan[2]
        for key in changshenshiergongshuju:
            if zhishigongtianpangan == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    for i in range(0, 2):
                        zhishigongdipanlist.append(zhishigongdipanganlist[i][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    listll = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    listll = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    listll = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    listll = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    listll = [+1, -1, -2, -1, -1, 0, 0, -1]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "癸" and "戊" in zhishigongdipanlist:
                    if yueganzhi[1] == "辰" and zhishigongdingwei_index == 0:
                        listll = [0, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        listll = [-2, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        listll = [+1, -1, -2, -1, -1, 0, 0, 4]
                        listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    else:
                        listll = [+1, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                else:
                    listll = changshenshiergongshuju[key]
                    listll_dingwei_index = listll[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + listll_dingwei_index
    else:
        zhishigongtianpanganlist = zhishigongtianpan.split("\n")
        for key in changshenshiergongshuju:
            if zhishigongtianpanganlist[0][-1] == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    zhishigongdipanlist.append(zhishigongdipanganlist[0][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    listll1 = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    listll1 = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    listll1 = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    listll1 = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    listll1 = [+1, -1, -2, -1, -1, 0, 0, -1]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "癸" and "戊" in zhishigongdipanlist:

                    if yueganzhi[1] == "辰" and zhishigongdingwei_index == 0:
                        listll1 = [0, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        listll1 = [-2, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        listll1 = [+1, -1, -2, -1, -1, 0, 0, 4]
                        listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    else:
                        listll1 = [+1, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                else:
                    listll1 = changshenshiergongshuju[key]
                    listll_dingwei_index1 = listll1[nigonghaoduiyingzidian[zhishigongdingwei_index]]
            if zhishigongtianpanganlist[1][-1] == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    zhishigongdipanlist.append(zhishigongdipanganlist[1][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    listll2 = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    listll2 = [0, -2, +1, +1, +1, -2, -1, -1]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    listll2 = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    listll2 = [0, +1, 0, -2, -2, 0, -2, 2]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    listll2 = [+1, -1, -2, -1, -1, 0, 0, -1]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                elif key == "癸" and "戊" in zhishigongdipanlist:
                    if yueganzhi[1] == "辰" and zhishigongdingwei_index == 0:
                        listll2 = [0, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        listll2 = [-2, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    elif yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        listll2 = [+1, -1, -2, -1, -1, 0, 0, 4]
                        listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                    else:
                        listll2 = [+1, -1, -2, -1, -1, 0, 0, -1]
                        listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
                else:
                    listll2 = changshenshiergongshuju[key]
                    listll_dingwei_index2 = listll2[nigonghaoduiyingzidian[zhishigongdingwei_index]]
        listll_index = (listll_dingwei_index1 + listll_dingwei_index2) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + listll_index
    # 天盘干与月令
    tian_gan_dict = {
        "乙": {
            "寅": -1, "卯": -1, "辰": -1, "巳": -1, "午": 0, "未": 1, "申": 2, "酉": 2, "戌": 1, "亥": -1, "子": -1,
            "丑": 1
        },
        "丙": {
            "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": -1, "申": 1, "酉": 1, "戌": 0, "亥": 2, "子": 1,
            "丑": 0
        },
        "丁": {
            "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": -1, "申": 1, "酉": 1, "戌": 0, "亥": 1, "子": 1,
            "丑": 0
        },
        "戊": {
            "寅": 1, "卯": 0, "辰": -1, "巳": 0, "午": -1, "未": -1, "申": 0, "酉": 0, "戌": -1, "亥": 1, "子": 1,
            "丑": -1
        },
        "己": {
            "寅": 0, "卯": 2, "辰": -1, "巳": -1, "午": -1, "未": -1, "申": -1, "酉": 0, "戌": -1, "亥": 1, "子": 1,
            "丑": -1
        },
        "庚": {
            "寅": -1, "卯": 1, "辰": 0, "巳": 1, "午": 2, "未": -1, "申": -1, "酉": -1, "戌": -1, "亥": 0, "子": 0,
            "丑": -1
        },
        "辛": {
            "寅": 1, "卯": 1, "辰": 0, "巳": 1, "午": 1, "未": -1, "申": -1, "酉": -2, "戌": 0, "亥": 0, "子": 0,
            "丑": 2
        },
        "壬": {
            "寅": 0, "卯": -1, "辰": 0, "巳": 0, "午": 0, "未": 1, "申": -2, "酉": -1, "戌": 2, "亥": -1, "子": -1,
            "丑": 2
        },
        "癸": {
            "寅": -1, "卯": 0, "辰": 0, "巳": 1, "午": 1, "未": 2, "申": -1, "酉": -1, "戌": 2, "亥": -1, "子": -1,
            "丑": 0
        }
    }
    if len(zhishigongtianpan) == 1 or len(zhishigongtianpan) == 3:
        for key in tian_gan_dict:
            if zhishigongtianpan[-1] == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    for i in range(0, 2):
                        zhishigongdipanlist.append(zhishigongdipanganlist[i][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    distll = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                              "酉": 0, "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    distll = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                              "酉": 0, "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    distll = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                              "酉": 0, "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    distll = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                              "酉": 0, "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    distll = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                              "酉": 1, "戌": 1, "亥": 1}
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                elif key == "癸" and "戊" in zhishigongdipanlist:
                    if yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        distll = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 1,
                                  "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        distll = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 0,
                                  "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                    else:
                        distll = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                                  "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
                else:
                    distll = tian_gan_dict[key]
                    changshengshiergongtianganyuevalue = distll[yueganzhi[1]]
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + changshengshiergongtianganyuevalue
    else:
        zhishigongtianpanganlist = zhishigongtianpan.split("\n")
        for key in tian_gan_dict:
            if zhishigongtianpanganlist[0][-1] == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    zhishigongdipanlist.append(zhishigongdipanganlist[0][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    distll1 = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                               "酉": 0,
                               "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    distll1 = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                               "酉": 0,
                               "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    distll1 = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                               "酉": 0,
                               "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    distll1 = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                               "酉": 0,
                               "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    distll1 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                               "酉": 1,
                               "戌": 1, "亥": 1}
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                elif key == "癸" and "戊" in zhishigongdipanlist:
                    if yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        distll1 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 1,
                                   "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        distll1 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 0,
                                   "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                    else:
                        distll1 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                                   "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
                else:
                    distll1 = tian_gan_dict[key]
                    changshengshiergongtianganyuevalue1 = distll1[yueganzhi[1]]
        for key in tian_gan_dict:
            if zhishigongtianpanganlist[1][-1] == key:
                zhishigongdipanlist = []
                if len(zhishigongdipan) == 1 or len(zhishigongdipan) == 3:
                    zhishigongdipanlist.append(zhishigongdipan[-1])
                else:
                    zhishigongdipanganlist = zhishigongdipan.split("\n")
                    zhishigongdipanlist.append(zhishigongdipanganlist[1][-1])
                if key == "乙" and "庚" in zhishigongdipanlist:
                    distll12 = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                                "酉": 0,
                                "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                elif key == "庚" and "乙" in zhishigongdipanlist:
                    distll12 = {"子": 0, "丑": -2, "寅": 1, "卯": 1, "辰": -1, "巳": 1, "午": 1, "未": 0, "申": -1,
                                "酉": 0,
                                "戌": 0, "亥": 0}
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                elif key == "丙" and "辛" in zhishigongdipanlist:
                    distll12 = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                                "酉": 0,
                                "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                elif key == "辛" and "丙" in zhishigongdipanlist:
                    distll12 = {"子": -1, "丑": 1, "寅": 0, "卯": 0, "辰": 1, "巳": 2, "午": 1, "未": 0, "申": -1,
                                "酉": 0,
                                "戌": -1, "亥": -1}
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                elif key == "戊" and "癸" in zhishigongdipanlist:
                    distll12 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                                "酉": 1,
                                "戌": 1, "亥": 1}
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                elif key == "癸" and "戊" in zhishigongdipanlist:
                    if yueganzhi[1] == "午" and zhishigongdingwei_index == 8:
                        distll12 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 1,
                                    "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                    elif yueganzhi[1] == "申" and zhishigongdingwei_index == 0:
                        distll12 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": 0, "未": 0, "申": 0,
                                    "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                    else:
                        distll12 = {"子": 1, "丑": 0, "寅": -1, "卯": -1, "辰": 0, "巳": -1, "午": -1, "未": 0, "申": 1,
                                    "酉": 1, "戌": 1, "亥": 1}
                        changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
                else:
                    distll12 = tian_gan_dict[key]
                    changshengshiergongtianganyuevalue12 = distll12[yueganzhi[1]]
        changshengshiergongtianganyuevalue = (
                                                         changshengshiergongtianganyuevalue1 + changshengshiergongtianganyuevalue12) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + changshengshiergongtianganyuevalue
    changshenshiergongczuizhong = SpaDigiX_APPONE_Value - changshengshiergongchushi
    print(f"7 长生十二宫：{changshenshiergongczuizhong}")
    # 新加的规则
    print("----------------------------------------------------------------------------------------------------------")
    print("8 新增规则")
    print("----------------------------")
    # 年、月、日、时-干、支因素
    yinyangdunshiyongchushi=SpaDigiX_APPONE_Value

    nianganzhiyinsu = yinyangdun_ganzhi[1]
    yueganzhiyinsu = yinyangdun_ganzhi[2]
    riganzhiyinsu = yinyangdun_ganzhi[3]
    shichengganzhiyinsu = yinyangdun_ganzhi[4]
    sanhejuliebiao = [{"申", "子", "辰"}, {"寅", "午", "戌"}, {"亥", "卯", "未"}, {"己", "酉", "丑"},
                      {"辰", "戌", "丑", "未"}]
    zhiliebiao = {nianganzhiyinsu[1], yueganzhiyinsu[1], riganzhiyinsu[1], shichengganzhiyinsu[1]}
    shirizhi = {riganzhiyinsu[1], shichengganzhiyinsu[1]}
    riyuezhi = {yueganzhiyinsu[1], riganzhiyinsu[1]}
    nianyuezhi = {nianganzhiyinsu[1], yueganzhiyinsu[1]}
    dizhiliuchong = [{"子", "午"}, {"丑", "未"}, {"寅", "申"}, {"卯", "酉"}, {"辰", "戌"}, {"己", "亥"}]
    dizhisimu = "丑未辰戌"
    dizhiliuhe = [{"子", "丑"}, {"寅", "亥"}, {"卯", "戌"}, {"辰", "酉"}, {"巳", "申"}, {"午", "未"}]
    # 年、月、日、时出现三合局无冲破-3（相邻时间冲才算冲破，有冲破+0）
    # 1.年、月、日、时亥卯未双三合-6。（卯、卯、亥、未）。(三合局力量很强）
    if nianganzhiyinsu[1] == "卯" and yueganzhiyinsu[1] == "卯" and riganzhiyinsu[1] == "亥" and shichengganzhiyinsu[
        1] == "未":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 6
        print("年、月、日、时亥卯未双三合（卯、卯、亥、未）：-6")
    elif zhiliebiao == sanhejuliebiao[0] or zhiliebiao == sanhejuliebiao[1] or zhiliebiao == sanhejuliebiao[
        2] or zhiliebiao == sanhejuliebiao[3] or zhiliebiao == sanhejuliebiao[4]:
        if shirizhi == dizhiliuchong[0] or shirizhi == dizhiliuchong[1] or shirizhi == dizhiliuchong[2] or shirizhi == \
                dizhiliuchong[3] or shirizhi == dizhiliuchong[4] or shirizhi == dizhiliuchong[5]:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            print("年月日时出现三合局有冲破：0")
        elif riyuezhi == dizhiliuchong[0] or riyuezhi == dizhiliuchong[1] or riyuezhi == dizhiliuchong[2] or riyuezhi == \
                dizhiliuchong[3] or riyuezhi == dizhiliuchong[4] or riyuezhi == dizhiliuchong[5]:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            print("年月日时出现三合局有冲破：0")
        elif nianyuezhi == dizhiliuchong[0] or nianyuezhi == dizhiliuchong[1] or nianyuezhi == dizhiliuchong[
            2] or nianyuezhi == dizhiliuchong[3] or nianyuezhi == dizhiliuchong[4] or nianyuezhi == dizhiliuchong[5]:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
            print("年月日时出现三合局有冲破：0")
        else:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 3
            print("年月日时出现三合局无冲破：-3")
    if YD == "阳遁":
        if nianganzhiyinsu[0] == "癸" and yueganzhiyinsu[0] == "癸" and riganzhiyinsu == "癸己" and shichengganzhiyinsu[
            0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 7
            print("年癸干，月癸干，日癸己，时癸干：-7")
        elif nianganzhiyinsu[0] == "癸" and yueganzhiyinsu[0] == "癸" and riganzhiyinsu == "癸卯" and \
                shichengganzhiyinsu[
                    0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 4
            print("年癸干，月癸干，日癸卯，时癸干：-4")
        elif nianganzhiyinsu[0] == "癸" and yueganzhiyinsu == "癸寅" and riganzhiyinsu == "癸寅" and \
                shichengganzhiyinsu[
                    0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("年癸干，月癸寅，日癸寅，时癸干：-2")
        if yueganzhiyinsu[0] == "己" and riganzhiyinsu == "癸未" and shichengganzhiyinsu == "癸丑":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("己月，日癸未，时癸丑：-2    ")

        if shichengganzhiyinsu[1] == yueganzhiyinsu[1]:
            liuheshiriyue = 0
            dizhisimushiyue = 0
            liuchongshiriyue = 0
            for i in dizhiliuhe:
                if riyuezhi == i or shirizhi == i:
                    liuheshiriyue = 1
            for j in dizhisimu:
                if shichengganzhiyinsu[1] == j or yueganzhiyinsu[1] == j:
                    dizhisimushiyue = 1
            for k in dizhiliuchong:
                if riyuezhi == k or shirizhi == k:
                    liuchongshiriyue = 1
            if liuheshiriyue == 1 or dizhisimushiyue == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                print("时、月同地支,与日支六合或者时月支入墓：0")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("时、月同地支：1")
            if liuchongshiriyue == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
                print("时、月同地支,冲日支：-2")
        if riganzhiyinsu[1] == yueganzhiyinsu[1]:
            shizhirumujishu = 0
            if shichengganzhiyinsu[1] in dizhisimu:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
                print("日、月同地支,时支入墓：2")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("日、月同地支：1")

        shiyuezhi = {shichengganzhiyinsu[1], riganzhiyinsu[1]}
        rishiliuhejishu = 0
        riyuyuechongorshiyuyuechong = 0
        if shichengganzhiyinsu[1] == riganzhiyinsu[1]:
            for i in dizhiliuchong:
                if riyuezhi == i or shiyuezhi == i:
                    riyuyuechongorshiyuyuechong = 1
            if riyuyuechongorshiyuyuechong == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                print("时、日同支,时、日支与月冲：0")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("时、日同支：1")
        for i in dizhiliuhe:
            if shirizhi == i:
                rishiliuhejishu = 1
        for i in dizhiliuchong:
            if riyuezhi == i or shiyuezhi == i:
                riyuyuechongorshiyuyuechong = 1
        if rishiliuhejishu == 1 and riyuyuechongorshiyuyuechong == 1:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("10.日支与时支六合，如果有一个与月支相冲：-2")
        if yueganzhiyinsu[1] == "午" and riganzhiyinsu == "乙未" and shichengganzhiyinsu[1] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 6
            print("双乙日（日时同干），午月，未日：-6")
        elif yueganzhiyinsu[1] == "辰" and riganzhiyinsu == "乙卯" and shichengganzhiyinsu[1] == "乙":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 4
            print("双乙日（日时同干），乙卯日，辰月：-4")
        if riganzhiyinsu[0] == "乙" and shichengganzhiyinsu[0] == "乙" and shichengganzhiyinsu == riganzhiyinsu:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
            print("双乙日（日时同干），时日同干支：1")
        if shichengganzhiyinsu[0] == "丙" and riganzhiyinsu[0] == "丙":
            riyuyuechongandshiyuyuechong = 0
            for i in dizhiliuchong:
                if riyuezhi == i or shiyuezhi == i:
                    riyuyuechongandshiyuyuechong = 1
            if riyuyuechongandshiyuyuechong == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
                print("双丙日，时、日支双冲月：-2")
            if shichengganzhiyinsu == riganzhiyinsu:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("双丙日，时日同干支：1")
        # 6.（甲寅月）日丁未,时丁未-2。
        if yueganzhiyinsu == "甲寅" and riganzhiyinsu == "丁未" and shichengganzhiyinsu == "丁未":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
        # 7.双已日，时、日同干支+1。
        if shichengganzhiyinsu[0] == "己" and riganzhiyinsu[0] == "己":
            shirizhichongjishu = 0
            for i in dizhiliuchong:
                if i == shirizhi:
                    shirizhichongjishu = 1
            if shichengganzhiyinsu == riganzhiyinsu:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("双已日，时、日同干支：1")
            elif shirizhichongjishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("双已日，时、日支冲：1")
        # 9.双已日，时支和日支六合,有任意一个冲月+2。
        if shichengganzhiyinsu[0] == "己" and riganzhiyinsu[0] == "己":
            shirizhiliuhejishu = 0
            for i in dizhiliuhe:
                if i == shirizhi:
                    shirizhiliuhejishu = 1
            shirichongyuejishu = 0
            for i in dizhiliuchong:
                if i == shiyuezhi or i == riyuezhi:
                    shirichongyuejishu = 1
            if shirizhiliuhejishu == 1 and shirichongyuejishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
                print("双已日，时支和日支六合,有任意一个冲月：2")
        # 已未日，时己干 +4。
        if riganzhiyinsu == "己未" and shichengganzhi[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
        # 双庚日，巳月-2
        if yueganzhiyinsu[1] == "巳" and riganzhiyinsu[0] == "庚" and shichengganzhiyinsu[0] == "庚":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("双庚日，巳月：-2")
        # 2.（甲寅月）庚戌日庚辰时 +4
        if yueganzhiyinsu == "甲寅" and riganzhiyinsu == "庚戌" and shichengganzhiyinsu == "庚辰":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
            print("2.（甲寅月）庚戌日庚辰时：4")
        # 3.双辛日，时、日同干支+1。
        if shichengganzhiyinsu[0] == "辛" and riganzhiyinsu[0] == "辛" and shichengganzhiyinsu == riganzhiyinsu:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
            print("双辛日，时、日同干支：1")
        # 双壬日（时日同干），+1。
        # 5.双壬日，日支辰+2。
        if shichengganzhiyinsu[0] == "壬" and riganzhiyinsu[0] == "壬":
            if riganzhiyinsu[1] == "辰":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
                print("双壬日，日支辰：2")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("双壬日:1")
        # .甲子日，已月+4。
        if riganzhiyinsu == "甲子" and yueganzhiyinsu[1] == "巳":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 4
            print("甲子日，已月：4")
        # 甲辰日，日月同支+1。
        if riganzhiyinsu == "甲辰" and riganzhiyinsu[1] == yueganzhiyinsu[1]:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
            print("甲辰日，日月同支：1")
        # 日地支子，已月，午时+2。
        if riganzhiyinsu[1] == "子" and yueganzhiyinsu[1] == "巳" and shichengganzhiyinsu[1] == "午":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("日地支子，已月，午时：2")
        # 日地支己，寅月+1。
        if riganzhiyinsu[1] == "巳" and yueganzhiyinsu[1] == "寅":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
            print("日地支己，寅月：1")
        # 日寅支，时午支，在已月  +2。
        if riganzhiyinsu[1] == "寅" and shichengganzhiyinsu[1] == "午" and yueganzhiyinsu[1] == "巳":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("日寅支，时午支，在已月：2")
        # 甲寅月，壬寅时，日壬干 +2
        if yueganzhiyinsu == "甲寅" and shichengganzhiyinsu == "壬寅" and riganzhiyinsu[0] == "壬":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("甲寅月，壬寅时，日壬干:2")
        ganlu = {"甲": "寅", "乙": "卯", "丙": "巳", "丁": "午", "戊": "巳", "己": "午", "庚": "申", "辛": "酉",
                 "壬": "亥", "癸": "子"}

        # 日、时同干，得碌在月-2。（如果是己干，则在午月）
        if riganzhiyinsu[0] == shichengganzhiyinsu[0]:
            for key in ganlu:
                if key == riganzhiyinsu[0]:
                    dizhiyuefen = ganlu[key]
            if yueganzhiyinsu[1] == dizhiyuefen:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
                print("日、时同干，得碌在月：-2")
    elif YD == "阴遁":
        # 1.时、月同支-1。
        if shichengganzhiyinsu[1] == yueganzhiyinsu[1]:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
            print("时、月同支:-1")
        # 2.时和日任意一个是丑支，且在未月-1。
        shiyuetongzhi = 0
        if shichengganzhiyinsu[1] == "丑" or riganzhiyinsu[1] == "丑":
            if yueganzhiyinsu[1] == "未":
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
                shiyuetongzhi = 1
                print("时和日任意一个是丑支，且在未月：-1")
        # 3.时支和日支冲（地支六冲：子午、丑未、寅申、卯酉、辰戌、已亥），时支，月支同不加0。
        shirizhichongjishu = 0
        for i in dizhiliuchong:
            if shirizhi == i:
                shirizhichongjishu = 1
        if shirizhichongjishu == 1:
            if shiyuetongzhi == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                print(" 时支和日支冲（地支六冲：子午、丑未、寅申、卯酉、辰戌、已亥），时支，月支同：0")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
                print("时支、日支冲：-1")
        # 5.月、日、时三同干，月支和时支为午支+2
        if yueganzhiyinsu[0] == shichengganzhiyinsu[0] and shichengganzhiyinsu[0] == riganzhiyinsu[0] and \
                yueganzhiyinsu[1] == "午" and shichengganzhiyinsu[1] == "午":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("5.月、日、时三同干，月支和时支为午支：2")
        # 6.午月，癸亥日 +2。
        if yueganzhiyinsu[1] == "午" and riganzhiyinsu == "癸亥":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("午月，癸亥日：2")
        # 7.时、月同干支 -1。
        if shichengganzhiyinsu == yueganzhiyinsu:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
            print("时、月同干支：-1")
        # 时、日同干支，时支，日支 冲月支用0
        # 9.时、日同干支 -1
        if shichengganzhiyinsu == riganzhiyinsu:
            shirizhichongyuezhijishu = 0
            for i in dizhiliuchong:
                if riyuezhi == i:
                    shirizhichongyuezhijishu = 1
            if shirizhichongyuezhijishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 0
                print("时、日同干支，时支，日支 冲月支：0")
            else:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
                print("时、日同干支：-1")
        # 10.时、日同支 且冲月支  -2。
        if shichengganzhiyinsu[1] == riganzhiyinsu[1]:
            shirizhichongyuezhijishu = 0
            for i in dizhiliuchong:
                if riyuezhi == i:
                    shirizhichongyuezhijishu = 1
            if shirizhichongyuezhijishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
                print("时、日同支 且冲月支：-2")
        if shichengganzhiyinsu[1] == yueganzhiyinsu[1]:
            shiyuechongrizhijishu = 0
            for i in dizhiliuchong:
                if i == riyuezhi:
                    shiyuechongrizhijishu = 1
            if shiyuechongrizhijishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
                print("时、月同支且冲日支：-2")

        # 12.双乙日，日支巳，戌月 +2。
        if shichengganzhiyinsu[0] == "乙" and riganzhiyinsu == "乙巳" and yueganzhiyinsu[1] == "戌":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("双乙日，日支巳，戌月：2")
        # 13.乙酉日，乙酉时，亥月 -4。
        if shichengganzhiyinsu == "乙酉" and riganzhiyinsu == "乙酉" and yueganzhiyinsu[1] == "亥":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 4
            print("乙酉日，乙酉时，亥月：-4")
        # 双戊日，+1。
        if shichengganzhiyinsu[0] == "戊" and riganzhiyinsu[0] == "戊":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
        # 已未月，已卯日，时己干 -3
        if yueganzhiyinsu == "己未" and riganzhiyinsu == "己卯" and shichengganzhiyinsu[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 3
            print("已未月，已卯日，时己干：-3")
        # 时庚干，庚申日，酉月 -2。
        if shichengganzhiyinsu[0] == "庚" and riganzhiyinsu == "庚申" and yueganzhiyinsu[1] == "酉":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("时庚干，庚申日，酉月：-2")
        # 17.双辛日， -1。
        if shichengganzhiyinsu[0] == "辛" and riganzhiyinsu[0] == "辛":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 1
            print("双辛日:-1")
        # 18.时壬干，壬申日，+1。
        if shichengganzhiyinsu[0] == "壬" and riganzhiyinsu == "壬申":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value = 1
            print("时壬干，壬申日：-1")
        # 19.双壬干，癸月干 -2。
        if shichengganzhiyinsu[0] == "壬" and riganzhiyinsu[0] == "壬" and yueganzhiyinsu[0] == "癸":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("双壬干，癸月干：-2")
        # 22.双癸干，日、时同干支 -2 。
        if shichengganzhiyinsu[0] == "癸" and riganzhiyinsu[0] == "癸" and shichengganzhiyinsu == riganzhiyinsu:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("双癸干，日、时同干支：-2")
        # 23.甲戌日，时，月己干 +2。
        if riganzhiyinsu == "甲戌" and shichengganzhiyinsu[0] == "己" and yueganzhiyinsu[0] == "己":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("甲戌日，时，月己干：2")
        # 24.甲子日，时支，月支相冲 +1。
        shiyuezhi = [shichengganzhiyinsu[1], yueganzhiyinsu[1]]
        if riganzhiyinsu == "甲子":
            shiyuezhixiangchongjishu = 0
            for i in dizhiliuchong:
                if i == shiyuezhi:
                    shiyuezhixiangchongjishu = 1
            if shiyuezhixiangchongjishu == 1:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 1
                print("甲子日，时支，月支相冲 ")
        # 月支子，日支亥 -2。
        if yueganzhiyinsu[1] == "子" and riganzhiyinsu[1] == "亥":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("月支子，日支亥：-2")
        # 26.亥月，寅日，时支午 -2
        if yueganzhiyinsu[1] == "亥" and riganzhiyinsu[1] == "寅" and shichengganzhiyinsu[1] == "午":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value - 2
            print("亥月，寅日，时支午：-2")
        # 日、月同亥支 +2。
        if riganzhiyinsu[1] == "亥" and yueganzhiyinsu[1] == "亥":
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + 2
            print("日、月同亥支")
    yinyangdunshiyongzuizhong = SpaDigiX_APPONE_Value - yinyangdunshiyongchushi
    # -----------------------------------------------------------------------------------------------------------------------
    print(
        "---------------------------------------------------------------------------------------------------------------\n---------------------------------------------------------------------------------------------------------------\n")
    print(f"全盘初判结果：{quanpanchupanjieguo}")
    print(f"后续结果：{SpaDigiX_APPONE_Value - quanpanchupanjieguo}")
    print(f"定位结果=全盘初判结果+后续结果={SpaDigiX_APPONE_Value}")
    return  SpaDigiX_APPONE_Value,neiwaidunzuizhong,yimazuizhong,tongbianyaosuzuizhong,kongwangzuizhong,zhichongzuizhong,fuyingzuizhong,fanyingzuizhong,jiaziwusanjimenzuizhong,jixionggejishuzuizhong,dangongtianpangandingshuzuizhong,dangongjiuxingliliangjishuzuizhong,dangongbamenliliangjishuzuizhong,dangongbashenliliangxiaozhangjishuzuizhong,changshenshiergongczuizhong,yinyangdunshiyongzuizhong