def gettheSpaDigiX_value(year, month , day , hour,dingweigong,shuanggan):
    from functionSpaDigiXAPPONE import getthebasicmessageofnineGrids
    ttttt=dingweigong
    year = int(year)
    month = int(month)
    day = int(day)
    hour = int(hour)
    fanhuixinxi = getthebasicmessageofnineGrids(year, month, day, hour)  # 通过应用0获得排盘的基本信息
    ninegridsbasicmessage = fanhuixinxi[0]  # 九宫基本信息
    yinyangdun_ganzhi = fanhuixinxi[1]  # 阴阳遁和干支信息
    if ttttt=="值使":
        for i in range(0, 9):
            if i == 4:
                pass
            else:
                bamenpanbiezhishi = ninegridsbasicmessage[i]["八门"]
                if "使" in bamenpanbiezhishi:
                    zhishigongdingwei_index = i  # 这个编号代表值使所在宫的代号
    elif ttttt=="生门":
        for i in range(0 , 9):
            if i == 4:
                pass
            else:
                bamenpanbiezhishi = ninegridsbasicmessage[i]["八门"]
                if "生" in bamenpanbiezhishi:
                    zhishigongdingwei_index = i  # 这个编号代表值使所在宫的代号
    elif ttttt=="值符":
        for i in range(0,9):
            if i ==4:
                pass
            else:
                bashenpanbie=ninegridsbasicmessage[i]["八神"]
                if "值符"==bashenpanbie:
                    zhishigongdingwei_index = i
    elif ttttt=="双干":
        for i in range(0,9):
            if i ==4:
                pass
            else:
                tianpanganshuju = ninegridsbasicmessage[i]["天盘"]
                if len(tianpanganshuju)==1 or len(tianpanganshuju)==3:
                    if shuanggan==tianpanganshuju[-1]:
                        zhishigongdingwei_index= i
                else:
                    tianpanganshuju_list=tianpanganshuju.split("\n")
                    if shuanggan==tianpanganshuju_list[0][-1] or shuanggan==tianpanganshuju_list[1][-1]:
                        zhishigongdingwei_index= i

    SpaDigiX_APPONE_Value = 0
    # 第一套基础编码
    # 请在此处调整数据
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # 1 全盘初判
    # 1.1 值使宫（值使用神），落内遁-1，落外遁+1
    luoneidun = -1  # 落内遁
    luowaidun = +1  # 落外遁
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.2 值使为用神，同边八要素加减规则
    tongbianyaosuyitong = +2  # 一同
    tongbianyaosuertong = +1  # 二同
    tongbianyaosusantong_kong = 0  # 三同（空）
    tongbianyaosusantong = -1  # 三同
    tongbianyaosusitong_kong = -1  # 四同（空）
    tongbianyaosusitong = -2  # 四同
    tongbianyaosuwutong = -2  # 五同
    tongbianyaosuliutong_kong = -2  # 六同（空）
    tongbianyaosuliutong = -3  # 六同
    tongbianyaosuqitong = -3  # 七同
    tongbianyaosubatong = -4  # 八同
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.3 值使宫隔合，宫内天干与出现邻宫天干五合状态
    gehegong = +1  # 隔合宫
    gehegong_dankong = +2  # 隔合宫（单空）
    gehegong_shuangkong = +2  # 隔合宫（双空）
    gehegong_sikong = +4  # 隔合宫（四空）
    geshuanggonghe = +2  # 隔双宫合
    geheyouzaihe = +2  # 隔合又再合
    # sigonghe=+1               #四宫合
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.4 驿马落（冲）用神宫
    yimaluoyongshengong = -1  # 落用神宫
    yimachongyongshengong = -1  # 冲用神宫
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.5 用神宫空亡
    yongshengongdankong = +1  # 单空
    yongshengongshuangkong = +2  # 双空
    yongshengongsikong = +4  # 四空
    liansikong = +2  # 连四空
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.6 伏吟
    quanfu = +2  # 全伏
    tianfufu = +2  # 天辅伏
    zhifu = +1  # 值伏
    menfu = +1  # 门伏
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.7 反吟
    quanfan = +2  # 反吟局（全反）
    zhifan = +1  # 值反
    menfan = +1  # 门反
    # -----------------------------------------------------------------------------------------------------------------------
    # 2 单宫部分
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.1 吉格
    wubing = -3  # 戊＋丙
    bingwu = -3  # 丙＋戊
    bingding = -1  # 丙＋丁
    yiwu_kaimen = -1  # 乙＋戊（开门）
    yiji_kaimen = -1  # 乙＋己（开门）
    tianpanding_xiumen_taiyin = -1  # 丁（休门）＋ 太阴神
    yi_kaixiusheng_xunsi = -1  # 乙（开门或休门或生门）＋巽四宫
    yixin_kaixiusheng = -1  # 乙＋辛（开门或休门或生门）
    yi_kaixiusheng_kanyigui = -1  # 乙（开门或休门或生门）＋坎一宫或癸
    yixin_xiusheng_genba = -1  # 乙＋辛（休门或生门）＋艮八宫
    yi_du_jiudi = -1  # 乙（杜门）＋九地神
    bing_sheng_jiutian = -1  # 丙（生门）＋九天神
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.2 三奇得使
    yijiaxu = -1  # 乙＋甲戌
    dingjiachen = -1  # 丁＋甲辰
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.3 玉女守门 （暂不考虑）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.4 三诈
    yiorbingording_kai_taiyin = -1  # 乙、丙、丁（开门）十神盘（太阴）
    yiorbingording_xiu_jiudi = -1  # 乙、丙、丁（体门）十神盘（九地）
    yiorbingording_sheng_liuhe = -1  # 乙、丙、丁（生门）十神盘（六合）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.5 五假
    yiorbingording_jing_jiutian = -1  # 乙、丙、丁十景门（九天）
    dingorjiorgui_du_jiuditaiyinliuhe = -1  # 丁、已、癸十杜门（九地、太阴、六合）
    dingorjiorgui_du_shang_liuhe = -1  # 丁、已、癸十伤门（六合）
    ren_jing_jiutian = -1  # 六壬十惊门（九天）
    dingorjiorgui_si_jiudi = -1  # 丁、已、癸十死门（九地）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.6 三奇升殿、奇游禄位 均为-1
    yi_kaixiusheng_zhengsan = -1  # 乙（震）（开、休、生）
    bing_kaixiusheng_lijiu = -1  # 丙（离）（开、休、生）
    ding_kaixiusheng_duiqi = -1  # 丁（兑）（开、休、生）
    bing_kaixiusheng_xunsi = -1  # 丙（巽）（开、休、生）
    ding_kaixiusheng_lijiu = -1  # 丁（离）（开、休、生）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.7 奇仪相合 加0 不考虑
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.8 交泰格、天运格
    yiding = -1  # 乙十丁
    dingbing = -1  # 丁十丙
    dingyi = -1  # 丁十乙
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.9 欢怡、相佐
    yiordingjiaziwu = -1  # 乙、丙、丁十六甲值符 ----->去掉丙，改六甲值符为甲子戊
    jiaziwuyiording = -1  # 六甲值符十乙、丙、丁 ----->去掉丙，改六甲值符为甲子戊
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.10 凶格
    gengbing = +3  # 庚十丙
    binggeng = +3  # 丙十庚
    yixin = +1  # 乙十辛
    xinyi = +1  # 辛十乙
    guiding = +1  # 癸十丁
    dinggui = +1  # 丁十癸
    jiaziwugeng = +3  # 六甲值符十庚 ----->改六甲值符为甲子戊
    gengjiaziwu = +3  # 庚十六甲值符 ----->改六甲值符为甲子戊
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.11 其他凶格（更凶）
    gengji = +2  # 刑格
    genggui = +2  # 大格
    gengren = +2  # 小格
    gengniangan = +2  # 岁格
    gengyuegan = +2  # 月格
    gengrigan = +2  # 日格
    gengshigan = +2  # 时格
    rigangeng = +2  # 飞干格
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.12 三奇入暮、时干入暮
    yi_qiankun = +1  # 乙（乾、坤）
    bing_qianliu = +1  # 丙（乾）
    ding_genqian = +1  # 丁（艮、乾）
    shiganwuxu = +1  # 戊戌
    shiganrencheng = +1  # 壬辰
    shiganbingxu = +1  # 丙戌
    shiganguiwei = +1  # 癸未
    shigandingchou = +1  # 丁丑
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.13 六仪击刑
    jiaziwu_zhengsan = +1  # 甲子戊（震）
    jiaxuji_kuner = +1  # 甲戌已（坤）
    jiashengeng_genba = +1  # 甲申庚（艮）
    jiawuxin_lijiu = +1  # 甲午辛（离）
    jiachenren_xunsi = +1  # 甲辰王（巽）
    jiayingui_xunsi = +1  # 甲寅癸（巽）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.14 奇格
    gengyiorbingording = +1  # 庚十乙、丙、丁
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.15 天网
    jiaziwugui = +1  # 六甲值符十癸 ----->六甲值符改为甲子戊
    guigui = +1  # 癸十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.16 五不遇时  （暂时不考虑）
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17 其他格
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.1 甲
    jiayi_jimen = -1  # 甲十乙(门吉)
    jiayi_xiongmen = +1  # 甲十乙(门凶)
    jiaxin_xiongmen = +1  # 甲十辛（门凶）
    jiaren = +1  # 甲十壬
    jiagui_jimen = -1  # 甲+癸(门吉)
    jiagui_xiongmen = +1  # 甲+癸(门凶)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.2 乙
    yijia = -1  # 乙十甲
    yibing = -1  # 乙十丙
    yibing_xiongmenxiongxin = +1  # 乙十丙（凶门星凶）
    yiding = -1  # 乙十丁
    yiwu = -1  # 乙十戊
    yiwu_xiongmenmenpo = +1  # 乙十戊（门凶门迫）
    yiji_jimen = -1  # 乙十己（三吉门）
    yiji_jimenchuwai = +1  # 乙十己（吉门除外）
    yigeng_kai_xun = -1  # 乙十庚（巽宫开门）
    yigeng_qita = +1  # 乙十庚（其他情况）
    yixin_sheng_gen = -1  # 乙十辛(艮宫、生门)
    yixin_kai_kun = -1  # 乙十辛(坤宫、开门)
    yixin_qita = +1  # 乙十辛(其他情况)
    yiren_xiongmen = +1  # 乙十壬（门凶）
    yiren_jimen = -1  # 乙十壬（门吉）
    yigui_jimen = -1  # 乙十癸(门吉)
    yigui_qita = +1  # 乙十癸(其他情况)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.3 丙
    bingyi = -1  # 丙十乙
    bingbing = +1  # 丙十丙
    bingding = -1  # 丙十丁
    bingji_jimen = -1  # 丙十已（吉门)
    bingji_xiongmen = +1  # 丙十已（凶门)
    bingxin = +1  # 丙十辛
    bingren = +1  # 丙十壬
    binggui = +1  # 丙十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.4 丁
    dingjia = -1  # 丁十甲
    dingding = +1  # 丁十丁
    dingwu = -1  # 丁十戊
    dingji = +1  # 丁十己
    dinggeng = +1  # 丁十庚
    dingxin = +1  # 丁十辛
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.5 戊
    wujia_jimen = -1  # 戊十甲（门吉）
    wuyi_jimen = -1  # 戊十乙(门吉)
    wuyi_xiongmen = +1  # 戊十乙(门凶)
    wuding = -1  # 戊十丁
    wuwu = +1  # 戊十戊
    wuxin_jimen = -1  # 戊十辛(门吉)
    wuxin_xiongmen = +1  # 戊十辛(门凶)
    wuren = +1  # 戊十壬
    jiaziwugui_mengongxiangshen = -1  # 戊十癸(门宫相生)
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.6 己
    jijia = +1  # 己十甲
    jiyi = +1  # 己十乙
    jibing = +1  # 己十丙
    jiding = -1  # 己十丁
    jiji = +1  # 己十己
    jigeng = +1  # 己十庚
    jixin = +1  # 己十辛
    jiren = +1  # 己十壬
    jigui = +1  # 己十癸
    # -----------------------------------------------------------------------------------------------------------------------、
    # 2.17.7 庚
    gengding = +1  # 庚十丁
    gengding_jimen = -1  # 庚十丁（吉门）
    genggeng = +2  # 庚十庚
    gengxin = +2  # 庚十辛
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.8 辛
    xinjia = +1  # 辛十甲
    xinbing_jimen = -1  # 辛十丙（门吉）
    xinbing_qita = +1  # 辛十丙（其他门）
    xinding = -1  # 辛十丁
    xinwu = +1  # 辛十戊
    xinji = +1  # 辛十己
    xingeng = +2  # 辛十庚
    xinxin = +1  # 辛十辛
    xinren = +1  # 辛十壬
    xingui = +1  # 辛十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.9 壬
    renjia = +1  # 壬十甲
    renyi = +1  # 壬十乙
    renbing = +1  # 壬十丙
    renwu = -1  # 壬十戊
    renji = +1  # 壬十己
    renxin = +1  # 壬十辛
    rengui = +1  # 壬十癸
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.17.10 癸
    guijia = -1  # 癸十甲
    guiyi_jimen = -1  # 癸十乙（门吉）
    guiyi_qita = +1  # 癸十乙（其他门）
    guibing = +1  # 癸十丙
    guiding = +1  # 癸十丁
    guiwu = -1  # 癸十戊
    guiwu_xiongmenpozhi = +1  # 癸十戊（门凶廹制）
    guiji = +1  # 癸十己
    guigeng = +1  # 癸十庚
    guixin = +1  # 癸十辛
    guiren = +1  # 癸十壬
    # -----------------------------------------------------------------------------------------------------------------------
    # 3 单宫天盘干定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.1 十二个月份各干定数数据
    month_dict_dangongtianpangandingshu = {
        "寅": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        "卯": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        "辰": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "巳": {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "午": {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "未": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "申": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "酉": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "戌": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        "亥": {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        "子": {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        "丑": {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.2 九宫各天盘干定数数据
    palace_dict_dangongtianpangandingshu = {
        0: {"甲": -1, "乙": -1, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": 0, "辛": 0, "壬": -1, "癸": -1},
        1: {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        2: {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        3: {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": 0, "癸": 0},
        5: {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        6: {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": 0, "己": 0, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        7: {"甲": 1, "乙": 1, "丙": 0, "丁": 0, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 1, "癸": 1},
        8: {"甲": 0, "乙": 0, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 1, "辛": 1, "壬": 1, "癸": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.3天盘干与地盘干五行力量消长定数数据
    tianpandingwei_dict_dangongtianpangandingshu = {
        "甲": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": -1, "癸": -1},
        "乙": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 1, "己": 1, "庚": 1, "辛": 1, "壬": -1, "癸": -1},
        "丙": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": -1, "己": 0, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "丁": {"甲": -1, "乙": -1, "丙": -1, "丁": -1, "戊": 0, "己": 0, "庚": 1, "辛": 1, "壬": 1, "癸": 1},
        "戊": {"甲": 1, "乙": 1, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 0, "辛": 0, "壬": 1, "癸": 1},
        "己": {"甲": 0, "乙": 1, "丙": -1, "丁": -1, "戊": -1, "己": -1, "庚": 0, "辛": 0, "壬": 1, "癸": 1},
        "庚": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 0, "癸": 0},
        "辛": {"甲": 1, "乙": 1, "丙": 1, "丁": 1, "戊": -1, "己": -1, "庚": -1, "辛": -1, "壬": 0, "癸": 0},
        "壬": {"甲": 0, "乙": 0, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "癸": {"甲": 0, "乙": 0, "丙": 1, "丁": 1, "戊": 1, "己": 1, "庚": -1, "辛": -1, "壬": -1, "癸": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 3.4 天盘干 长生 帝旺 墓 绝 十二宫得数：
    changshenglinguandiwang = -2  # 天盘干位于 长生 临官 帝旺
    guandaishuai = -1  # 天盘干位于 冠带 衰
    taiyangmuyu = 0  # 天盘干位于 胎 养 沐浴
    bingsijue = +2  # 天盘干位于 病 死 绝
    mu = +1  # 天盘干位于 墓
    # 动物宫与天盘干对应表
    tianpanganduiyingongweishengxiao = {
        "甲": ["亥", "子", "丑", "寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌"],
        "乙": ["午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未"],
        "丙": ["寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
        "丁": ["酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
        "戊": ["寅", "卯", "辰", "已", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
        "己": ["酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑", "子", "亥", "戌"],
        "庚": ["已", "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰"],
        "辛": ["子", "亥", "戌", "酉", "申", "未", "午", "已", "辰", "卯", "寅", "丑"],
        "壬": ["申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "已", "午", "未"],
        "癸": ["卯", "寅", "丑", "子", "亥", "戌", "酉", "申", "未", "午", "已", "辰"]
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4 单宫九星力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.1 十二月各星力量
    yuefenduiyingjiuxingliliang = {
        "寅": {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        "卯": {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        "辰": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        "巳": {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": -1},
        "午": {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": -1},
        "未": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        "申": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        "酉": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        "戌": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": 1},
        "亥": {"天蓬": -1, "天芮": 1, "天冲": 1, "天辅": 1, "天禽": 1, "天心": -1, "天柱": -1, "天任": 1, "天英": 1},
        "子": {"天蓬": -1, "天芮": 1, "天冲": 1, "天辅": 1, "天禽": 1, "天心": -1, "天柱": -1, "天任": 1, "天英": 1},
        "丑": {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.2 九宫各星力量
    jiugonggexingliliangshuju = {
        0: {"天蓬": -1, "天芮": 1, "天冲": 1, "天辅": 1, "天禽": 1, "天心": -1, "天柱": -1, "天任": 1, "天英": 1},
        1: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        2: {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        3: {"天蓬": -1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": 1, "天英": 1},
        5: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        6: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": -1, "天柱": -1, "天任": -1, "天英": 1},
        7: {"天蓬": 1, "天芮": -1, "天冲": 1, "天辅": 1, "天禽": -1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1},
        8: {"天蓬": 1, "天芮": 1, "天冲": -1, "天辅": -1, "天禽": 1, "天心": 1, "天柱": 1, "天任": -1, "天英": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.3 吉凶星变化
    jiuxingyutianpanganbianhuashuju = {
        "天辅": {"甲": -1, "乙": -1, "丙": -1, "丁": -1},
        "天禽": {"戊": -1, "己": -1, "庚": -1, "辛": -1},
        "天心": {"庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "天冲": {"甲": -1, "乙": -1, "丙": -1, "丁": -1},
        "天英": {"丙": -1, "丁": -1, "戊": -1, "己": -1},
        "天蓬": {"甲": 1, "乙": 1, "戊": 1, "己": 1},
        "天芮": {"丙": 1, "丁": 1, "壬": 1, "癸": 1},
        "天柱": {"丙": 1, "丁": 1, "戊": 1, "己": 1},
        "天任": {"戊": -1, "己": -1, "庚": -1, "辛": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5 单宫八门力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.1 八门在十二个月力量
    bamenshieryueshuju = {
        "寅": {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        "卯": {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        "辰": {"开": -1, "休": 1, "生": -1, "伤": -1, "杜": -1, "景": -1, "死": -1, "惊": -1},
        "巳": {"开": 1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 1},
        "午": {"开": 1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 1},
        "未": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 1},
        "申": {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 1, "惊": -1},
        "酉": {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 1, "惊": -1},
        "戌": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "亥": {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": 1},
        "子": {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": 1},
        "丑": {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.2 八门在九宫中力量消长
    bamenjiugongliliangxiaozhangshuju = {
        0: {"开": -1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 1, "死": 1, "惊": -1},
        1: {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": -1},
        2: {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        3: {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": -1, "死": 1, "惊": 1},
        5: {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 1, "惊": -1},
        6: {"开": -1, "休": -1, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": 1, "惊": -1},
        7: {"开": -1, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": 1, "惊": -1},
        8: {"开": 1, "休": 1, "生": -1, "伤": -1, "杜": 0, "景": -1, "死": -1, "惊": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.3 几种特殊门遇天盘干 地盘干的变化
    # 遇地盘干
    menyudipanganshuju = {
        "开": {"丙": -1, "丁": -1, "戊": -1, "己": -1},
        "休": {"庚": -1, "辛": -1, "戊": -1, "己": -1},
        "生": {"甲": -1, "乙": -1, "壬": -1, "癸": -1},
        "死": {"庚": 1, "辛": 1, "戊": 1, "己": 1},
        "惊": {"壬": 1, "癸": 1, "庚": 1, "辛": 1}
    }
    # 遇天盘干
    menyutianpanganshuju = {
        "开": {"庚": -1, "辛": -1, "壬": -1, "癸": -1},
        "休": {"甲": -1, "乙": -1, "壬": -1, "癸": -1},
        "生": {"庚": -1, "辛": -1, "戊": -1, "己": -1},
        "死": {"壬": 1, "癸": 1, "甲": 1, "乙": 1},
        "惊": {"甲": 1, "乙": 1, "丙": 1, "丁": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 6 八神单宫力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.1 八神在十二月力量消长
    bashenshieryueliliangxiaozhangshuju = {
        "寅": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 0, "九地": 1, "九天": 1},
        "卯": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 0, "九地": 1, "九天": 1},
        "辰": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "巳": {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": 0, "白虎": 1, "玄武": 1, "九地": -1, "九天": 1},
        "午": {"值符": 0, "螣蛇": -1, "太阴": 1, "六合": 0, "白虎": 1, "玄武": 1, "九地": -1, "九天": 1},
        "未": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 0, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "申": {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": -1, "九地": 0, "九天": -1},
        "酉": {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": -1, "九地": 0, "九天": -1},
        "戌": {"值符": 1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": -1, "九天": -1},
        "亥": {"值符": -1, "螣蛇": 1, "太阴": 0, "六合": -1, "白虎": 0, "玄武": -1, "九地": 1, "九天": 0},
        "子": {"值符": -1, "螣蛇": 1, "太阴": 0, "六合": -1, "白虎": 0, "玄武": -1, "九地": 1, "九天": 0},
        "丑": {"值符": -1, "螣蛇": 0, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 1, "九地": 1, "九天": -1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.2 八神在九宫内力量消长
    bashenzaijiugongliliangxiaozhangshuju = {
        0: {"值符": -1, "螣蛇": 1, "太阴": -1, "六合": 0, "白虎": -1, "玄武": -1, "九地": 1, "九天": -1},
        1: {"值符": 1, "螣蛇": -1, "太阴": 0, "六合": 1, "白虎": 1, "玄武": 1, "九地": -1, "九天": 0},
        2: {"值符": -1, "螣蛇": 0, "太阴": 1, "六合": -1, "白虎": 1, "玄武": -1, "九地": 1, "九天": 1},
        3: {"值符": -1, "螣蛇": 0, "太阴": 1, "六合": -1, "白虎": 1, "玄武": -1, "九地": 1, "九天": 1},
        5: {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 0, "九地": -1, "九天": -1},
        6: {"值符": 1, "螣蛇": 1, "太阴": -1, "六合": 1, "白虎": -1, "玄武": 0, "九地": -1, "九天": -1},
        7: {"值符": 1, "螣蛇": -1, "太阴": -1, "六合": 1, "白虎": 0, "玄武": 1, "九地": -1, "九天": 0},
        8: {"值符": -1, "螣蛇": -1, "太阴": 1, "六合": -1, "白虎": 1, "玄武": 1, "九地": 0, "九天": 1}
    }
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------

    # 一、全盘初判
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.1 值使宫（值使用神），落内遁-1，落外遁+1
    # ------------------------------------
    zuocegonghao = [0, 7, 2, 3]
    youcegonghao = [8, 1, 6, 5]
    yinyangdun = yinyangdun_ganzhi[0]
    # -------------------------------------
    # 1.2 值使为用神，同边八要素加减规则
    # -------------------------------------
    # 八要素所在宫号获取
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            zhishigongpanbiezifu = ninegridsbasicmessage[i]["八门"]
            if zhishigongpanbiezifu[-1] == "使":
                zhishigongdingwei_indexc = i  # 值使所在宫号

    # 值符
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            bashenpanbiezhifu = ninegridsbasicmessage[i]["八神"]
            if bashenpanbiezhifu == "值符":
                zhifugongdingwei_index = i  # 值符所在宫号
    # 生门
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            bamenpanbieshengmen = ninegridsbasicmessage[i]["八门"]
            if bamenpanbieshengmen == "生" or bamenpanbieshengmen == "生使":
                shengmendingwei_index = i  # 生门所在宫号
            else:
                pass
    # 甲子戊
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbiejiaziwu = ninegridsbasicmessage[i]["天盘"]
            if len(tianpanpanbiejiaziwu) == 1:
                pass
            elif len(tianpanpanbiejiaziwu) == 3:
                if tianpanpanbiejiaziwu == "甲子戊":
                    jiaziwudingwei_index = i
            else:
                tianpanchaifenliebiao = tianpanpanbiejiaziwu.split("\n")
                if len(tianpanchaifenliebiao[0]) == 1:
                    if tianpanchaifenliebiao[1] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号
                elif len(tianpanchaifenliebiao[1]) == 1:
                    if tianpanchaifenliebiao[0] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号
                else:
                    if tianpanchaifenliebiao[0] == "甲子戊" or tianpanchaifenliebiao[1] == "甲子戊":
                        jiaziwudingwei_index = i  # 甲子戊所在宫号

    # 干支
    nianganzhi = yinyangdun_ganzhi[1]
    yueganzhi = yinyangdun_ganzhi[2]
    riganzhi = yinyangdun_ganzhi[3]
    shichengganzhi = yinyangdun_ganzhi[4]
    # 年干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieniangan = ninegridsbasicmessage[i]["天盘"]
            if nianganzhi[0] == "甲":
                if len(tianpanpanbieniangan) == 1:
                    pass
                elif len(tianpanpanbieniangan) == 3:
                    if nianganzhi == tianpanpanbieniangan[0:2]:
                        niangandingwei_index = i
                else:
                    tianpanpanbienianganliebiao = tianpanpanbieniangan.split("\n")
                    if len(tianpanpanbienianganliebiao[0]) == 1:
                        if nianganzhi == tianpanpanbienianganliebiao[1][0:2]:
                            niangandingwei_index = i
                    elif len(tianpanpanbienianganliebiao[1]) == 1:
                        if nianganzhi == tianpanpanbienianganliebiao[0][0:2]:
                            niangandingwei_index = i
                    else:
                        if nianganzhi == tianpanpanbienianganliebiao[0][0:2] or nianganzhi == \
                                tianpanpanbienianganliebiao[1][0:2]:
                            niangandingwei_index = i
            else:
                if len(tianpanpanbieniangan) == 1:
                    if nianganzhi[0] == tianpanpanbieniangan:
                        niangandingwei_index = i
                elif len(tianpanpanbieniangan) == 3:
                    if nianganzhi[0] == tianpanpanbieniangan[-1]:
                        niangandingwei_index = i
                else:
                    tianpanpanbienianganliebiao = tianpanpanbieniangan.split("\n")
                    if nianganzhi[0] == tianpanpanbienianganliebiao[0][-1] or nianganzhi[0] == \
                            tianpanpanbienianganliebiao[1][-1]:
                        niangandingwei_index = i
    # 月干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieyuegan = ninegridsbasicmessage[i]["天盘"]
            if yueganzhi[0] == "甲":
                if len(tianpanpanbieyuegan) == 1:
                    pass
                elif len(tianpanpanbieyuegan) == 3:
                    if yueganzhi == tianpanpanbieyuegan[0:2]:
                        yuegandingwei_index = i
                else:
                    tianpanpanbieyueganliebiao = tianpanpanbieyuegan.split("\n")
                    if len(tianpanpanbieyueganliebiao[0]) == 1:
                        if yueganzhi == tianpanpanbieyueganliebiao[1][0:2]:
                            yuegandingwei_index = i
                    elif len(tianpanpanbieyueganliebiao[1]) == 1:
                        if yueganzhi == tianpanpanbieyueganliebiao[0][0:2]:
                            yuegandingwei_index = i
                    else:
                        if yueganzhi == tianpanpanbieyueganliebiao[0][0:2] or yueganzhi == tianpanpanbieyueganliebiao[
                                                                                               1][0:2]:
                            yuegandingwei_index = i
            else:
                if len(tianpanpanbieyuegan) == 1:
                    if yueganzhi[0] == tianpanpanbieyuegan:
                        yuegandingwei_index = i
                elif len(tianpanpanbieyuegan) == 3:
                    if yueganzhi[0] == tianpanpanbieyuegan[-1]:
                        yuegandingwei_index = i
                else:
                    tianpanpanbieyueganliebiao = tianpanpanbieyuegan.split("\n")
                    if yueganzhi[0] == tianpanpanbieyueganliebiao[0][-1] or yueganzhi[0] == \
                            tianpanpanbieyueganliebiao[1][-1]:
                        yuegandingwei_index = i

    # 日干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbierigan = ninegridsbasicmessage[i]["天盘"]
            if riganzhi[0] == "甲":
                if len(tianpanpanbierigan) == 1:
                    pass
                elif len(tianpanpanbierigan) == 3:
                    if riganzhi == tianpanpanbierigan[0:2]:
                        rigandingwei_index = i
                else:
                    tianpanpanbieriganliebiao = tianpanpanbierigan.split("\n")
                    if len(tianpanpanbieriganliebiao[0]) == 1:
                        if riganzhi == tianpanpanbieriganliebiao[1][0:2]:
                            rigandingwei_index = i
                    elif len(tianpanpanbieriganliebiao[1]) == 1:
                        if riganzhi == tianpanpanbieriganliebiao[0][0:2]:
                            rigandingwei_index = i
                    else:
                        if riganzhi == tianpanpanbieriganliebiao[0][0:2] or riganzhi == tianpanpanbieriganliebiao[1][
                                                                                        0:2]:
                            rigandingwei_index = i
            else:
                if len(tianpanpanbierigan) == 1:
                    if riganzhi[0] == tianpanpanbierigan:
                        rigandingwei_index = i
                elif len(tianpanpanbierigan) == 3:
                    if riganzhi[0] == tianpanpanbierigan[-1]:
                        rigandingwei_index = i
                else:
                    tianpanpanbieriganliebiao = tianpanpanbierigan.split("\n")
                    if riganzhi[0] == tianpanpanbieriganliebiao[0][-1] or riganzhi[0] == tianpanpanbieriganliebiao[1][
                        -1]:
                        rigandingwei_index = i
    # 时干宫号
    for i in range(0, 9):
        if i == 4:
            pass
        else:
            tianpanpanbieshichenggan = ninegridsbasicmessage[i]["天盘"]
            if shichengganzhi[0] == "甲":
                if len(tianpanpanbieshichenggan) == 1:
                    pass
                elif len(tianpanpanbieshichenggan) == 3:
                    if shichengganzhi == tianpanpanbieshichenggan[0:2]:
                        shichenggandingwei_index = i
                else:
                    tianpanpanbieshichengganliebiao = tianpanpanbieshichenggan.split("\n")
                    if len(tianpanpanbieshichengganliebiao[0]) == 1:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[1][0:2]:
                            shichenggandingwei_index = i
                    elif len(tianpanpanbieshichengganliebiao[1]) == 1:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[0][0:2]:
                            shichenggandingwei_index = i
                    else:
                        if shichengganzhi == tianpanpanbieshichengganliebiao[0][0:2] or shichengganzhi == \
                                tianpanpanbieshichengganliebiao[1][0:2]:
                            shichenggandingwei_index = i
            else:
                if len(tianpanpanbieshichenggan) == 1:
                    if shichengganzhi[0] == tianpanpanbieshichenggan:
                        shichenggandingwei_index = i
                elif len(tianpanpanbieshichenggan) == 3:
                    if shichengganzhi[0] == tianpanpanbieshichenggan[-1]:
                        shichenggandingwei_index = i
                else:
                    tianpanpanbieshichengganliebiao = tianpanpanbieshichenggan.split("\n")
                    if shichengganzhi[0] == tianpanpanbieshichengganliebiao[0][-1] or shichengganzhi[0] == \
                            tianpanpanbieshichengganliebiao[1][-1]:
                        shichenggandingwei_index = i
    # 六十甲子+空亡
    list1jiazi = ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申",
                  "癸酉", "戌亥"]
    list2jiaxu = ["甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午",
                  "癸未", "申酉"]
    list3jiashen = ["甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰",
                    "癸巳", "午未"]
    list4jiawu = ["甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅",
                  "癸卯", "辰巳"]
    list5jiachen = ["甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子",
                    "癸丑", "寅卯"]
    list6jiayin = ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌",
                   "癸亥", "子丑"]
    listliushijiazi = [list1jiazi, list2jiaxu, list3jiashen, list4jiawu, list5jiachen, list6jiayin]
    gongshengxiaoduiying = {0: "子", 1: "未申", 2: "卯", 3: "辰巳", 5: "亥戌", 6: "酉", 7: "丑寅", 8: "午"}
    # 日干空
    for i in listliushijiazi:
        for j in i:
            if riganzhi == j:
                rikongzifuchuang = i[-1]
                fshibierigan = i
                break
            else:
                pass
    # 时干空
    for i in listliushijiazi:
        for j in i:
            if shichengganzhi == j:
                shikongzifuchuang = i[-1]
                fshibieshigan = i
                break
            else:
                pass
    kongwanglist = []
    for i in rikongzifuchuang:
        kongwanglist.append(i)
    for i in shikongzifuchuang:
        kongwanglist.append(i)
    tonggongjici=0
    tonggongwuyaosudingwei=[zhishigongdingwei_indexc,zhifugongdingwei_index,shengmendingwei_index,shichenggandingwei_index,rigandingwei_index]
    for i in range(0,5):
        if tonggongwuyaosudingwei[i]==zhishigongdingwei_index:
            tonggongjici=tonggongjici+1

    zhishigongshengxiaodizhi = gongshengxiaoduiying[zhishigongdingwei_index]
    KONGWANGSHU = 0
    for i in kongwanglist:
        if i in zhishigongshengxiaodizhi:
            KONGWANGSHU = KONGWANGSHU + 1
        else:
            pass
    # print("同边其他宫空亡数：",TONGBIANKONGWANGSHU-KONGWANGSHU)
    # print("同边要素总空亡数=值使宫空亡数+同边其他宫空亡数=",TONGBIANKONGWANGSHU)
    if tonggongjici==2:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value-1
    elif tonggongjici==3:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value-2
    elif tonggongjici==4:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value-3
    elif tonggongjici==5:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value-4
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.3 值使宫隔合 宫内天干出现邻宫五合现象
    # -----------------------------------------------------------------------------------------------------------------------
    zhishigongtianpan = ninegridsbasicmessage[zhishigongdingwei_index]["天盘"]
    '''
    if len(zhishigongtianpan)<=3:
        if len(zhishigongtianpan)==1:
            zhishigongtianpangan=zhishigongtianpan
        if len
    '''
    # 1.4驿马落用神宫
    Yimadist = {"申子辰": "寅", "亥卯未": "巳", "寅午戌": "申", "巳酉丑": "亥"}
    for key in Yimadist:
        if shichengganzhi[1] in key:
            yima = Yimadist[key]
            break
        else:
            pass
    for key in gongshengxiaoduiying:
        if yima in gongshengxiaoduiying[key]:
            yimagonghao = key
    chongyongshenggonglist = {7: 1, 3: 5, 1: 7, 5: 3}
    if yimagonghao == zhishigongdingwei_index:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yimaluoyongshengong
    elif yimagonghao != zhishigongdingwei_index:
        if zhishigongdingwei_index == 7 or zhishigongdingwei_index == 3 or zhishigongdingwei_index == 1 or zhishigongdingwei_index == 5:
            if yimagonghao == chongyongshenggonglist[zhishigongdingwei_index]:
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yimachongyongshengong
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.5用神宫空亡
    # -----------------------------------------------------------------------------------------------------------------------
    if KONGWANGSHU == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongdankong
    elif KONGWANGSHU == 2:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongshuangkong
    elif KONGWANGSHU == 4:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yongshengongsikong


    # print("总数：",SpaDigiX_APPONE_Value)
    # -----------------------------------------------------------------------------------------------------------------------
    # 1.6伏吟
    # -----------------------------------------------------------------------------------------------------------------------
    # 全伏
    kunergongshuju = ninegridsbasicmessage[1]
    if kunergongshuju["天盘"] == kunergongshuju["地盘"] and (
            kunergongshuju["八门"] == "死" or kunergongshuju["八门"] == "死使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + quanfu
    elif kunergongshuju["天盘"] == kunergongshuju["地盘"] and kunergongshuju["八门"] != "死" and kunergongshuju[
        "八门"] != "死使":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhifu
    elif kunergongshuju["天盘"] != kunergongshuju["地盘"] and (
            kunergongshuju["八门"] == "死" or kunergongshuju["八门"] == "死使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + menfu
    # -----------------------------------------------------------------------------------------------------------------------
    # 反吟
    genbagongshuju = ninegridsbasicmessage[7]
    if kunergongshuju["天盘"] == genbagongshuju["地盘"] and (
            kunergongshuju["八门"] == "生" or kunergongshuju["八门"] == "生使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + quanfan
    elif kunergongshuju["天盘"] != genbagongshuju["地盘"] and (
            kunergongshuju["八门"] == "生" or kunergongshuju["八门"] == "生使"):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + menfan
    elif kunergongshuju["天盘"] == genbagongshuju["地盘"] and kunergongshuju["八门"] != "生" and kunergongshuju[
        "八门"] != "生使":
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhifan
    quanpanchupanjieguo = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------

    # 2 单宫部分（以值使做用神为例）
    zhishigongshuju = ninegridsbasicmessage[zhishigongdingwei_index]  # 读取值使所在宫的数据
    # -----------------------------------------------------------------------------------------------------------------------
    # 2.1 吉格
    jixionggejishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    # 戊＋丙
    zhishigongtianpan = zhishigongshuju["天盘"]
    zhishigongtianpanjishu = 0
    zhishigongdipan = zhishigongshuju["地盘"]
    zhishigongdipanjishu = 0
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wubing
    # 丙＋戊
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingwu
    # 丙＋丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingding
    '''
    #乙+甲子戊（开门）
    zhishigongbamen=zhishigongshuju["八门"]
    zhishigongbamenjishu=0
    if zhishigongbamen=="开使":
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0

    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="乙" or zhishigongtianpanlist[1]=="乙":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="乙":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanjishu=0

    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="甲子戊" or zhishigongdipanlist[1]=="甲子戊":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==3:
        if zhishigongdipan=="甲子戊":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0
    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and zhishigongbamenjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+yiwu_kaimen
    '''
    # 乙＋甲戌己（开门）
    zhishigongbamen = zhishigongshuju["八门"]
    zhishigongbamenjishu = 0
    if zhishigongbamen[0] == "开":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiji_kaimen
    # 丁（休门)+太阴神
    zhishigongbashen = zhishigongshuju["八神"]
    zhishigongbashenjishu = 0
    if zhishigongbashen == "太阴":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0

    if zhishigongbamen[0]== "休":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tianpanding_xiumen_taiyin
    # 乙(开门或休门或生门)+巽四宫
    zhishigonggonghaojishu = 0
    if zhishigongdingwei_index == 3:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongbamen[0]== "休" or zhishigongbamen[0] == "开" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yi_kaixiusheng_xunsi

    # 乙+甲午辛（开门或休门或生门）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongbamen[0]== "休" or zhishigongbamen[0] == "开" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_kaixiusheng

    # 乙（开休生）+坎一宫或甲寅癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongdingwei_index == 0:
        zhishigonggonghaojishu == 1
    else:
        zhishigonggonghaojishu == 0

    if zhishigongbamen[0] == "休" or zhishigongbamen[0] == "开" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and (
            zhishigonggonghaojishu == 1 or zhishigongdipanjishu == 1):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yi_kaixiusheng_kanyigui

    # 乙+甲午辛（休或生）+艮八宫
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongbamen[0] == "休" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if zhishigongdingwei_index == 7:
        zhishigonggonghaojishu == 1
    else:
        zhishigonggonghaojishu == 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_xiusheng_genba

    # 乙（杜门）+九地
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongbamen[0] == "杜":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if zhishigongbashen == "九地":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yi_du_jiudi
    # 丙（生门）+九天
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0

    if zhishigongbashen == "九天":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bing_sheng_jiutian

    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    # 乙+甲戌己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yijiaxu

    # 丁+甲辰壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingjiachen
    # 2.3玉女守门 不考虑
    # 2.4 三诈
    # 乙、丙、丁（开门）十神盘（太阴）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[0] == "丙" or \
                zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
            1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if zhishigongbamen[0] == "开":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongbashen == "太阴":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_kai_taiyin
    # 乙、丙、丁（休门）十神盘（九地）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[0] == "丙" or \
                zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
            1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongbamen[0] == "休":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongbashen == "九地":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_xiu_jiudi
    # 乙、丙、丁（生门）十神盘（六合）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[0] == "丙" or \
                zhishigongtianpanlist[1] == "丙" or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[
            1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁" or zhishigongtianpan == "丙" or zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongbashen == "六合":
        zhishigongbashenjishu = 1
    else:
        zhishigongbashenjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongbamenjishu == 1 and zhishigongbashenjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_sheng_liuhe
    '''
    #2.5 五假
    #乙、丙、丁十景门（九天）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丁" or zhishigongtianpanlist[1]=="丁" or zhishigongtianpanlist[0]=="丙" or zhishigongtianpanlist[1]=="丙"or zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丁" or zhishigongtianpan=="丙" or zhishigongtianpan=="乙":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanjishu=0
    if zhishigongbamen=="景使" :
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0
    if zhishigongbashen=="九天":
        zhishigongbashenjishu=1
    else:
        zhishigongbashenjishu=0

    if zhishigongtianpanjishu==1 and zhishigongbamenjishu==1 and zhishigongbashenjishu==1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiorbingording_jing_jiutian
    #丁、已、癸十杜门（九地、太阴、六合）

    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丁" or zhishigongtianpanlist[1]=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="甲戌己" or zhishigongtianpanlist[1]=="甲戌己" or zhishigongtianpanlist[0]=="甲寅癸" or zhishigongtianpanlist[1]=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲戌己" or zhishigongtianpan=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    else:
        zhishigongtianpanjishu2=0
    if zhishigongbamen=="杜使" :
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0
    if zhishigongbashen=="九地" or  zhishigongbashen=="太阴" or zhishigongbashen=="六合":
        zhishigongbashenjishu=1
    else:
        zhishigongbashenjishu=0
    if (zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1)  and zhishigongbamenjishu==1 and zhishigongbashenjishu==1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingorjiorgui_du_jiuditaiyinliuhe
    #丁、已、癸十伤门（六合）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丁" or zhishigongtianpanlist[1]=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="甲戌己" or zhishigongtianpanlist[1]=="甲戌己" or zhishigongtianpanlist[0]=="甲寅癸" or zhishigongtianpanlist[1]=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲戌己" or zhishigongtianpan=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    else:
        zhishigongtianpanjishu2=0

    if zhishigongbamen=="伤使" :
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0

    if zhishigongbashen=="六合":
        zhishigongbashenjishu=1
    else:
        zhishigongbashenjishu=0
    if (zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1)  and zhishigongbamenjishu==1 and zhishigongbashenjishu==1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingorjiorgui_du_shang_liuhe

    #六壬十惊门（九天）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="甲辰壬" or zhishigongtianpanlist[1]=="甲辰壬":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲辰壬":
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanjishu=0

    if zhishigongbamen=="惊使" :
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0

    if zhishigongbashen=="九天":
        zhishigongbashenjishu=1
    else:
        zhishigongbashenjishu=0

    if zhishigongtianpanjishu==1  and zhishigongbamenjishu==1 and zhishigongbashenjishu==1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + ren_jing_jiutian
    #丁、已、癸十死门（九地）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丁" or zhishigongtianpanlist[1]=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="甲戌己" or zhishigongtianpanlist[1]=="甲戌己" or zhishigongtianpanlist[0]=="甲寅癸" or zhishigongtianpanlist[1]=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲戌己" or zhishigongtianpan=="甲寅癸":
            zhishigongtianpanjishu2=1
        else:
            zhishigongtianpanjishu2=0
    else:
        zhishigongtianpanjishu2=0
    if zhishigongbamen=="死使" :
        zhishigongbamenjishu=1
    else:
        zhishigongbamenjishu=0

    if zhishigongbashen=="九地":
        zhishigongbashenjishu=1
    else:
        zhishigongbashenjishu=0
    if (zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1)  and zhishigongbamenjishu==1 and zhishigongbashenjishu==1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingorjiorgui_si_jiudi
    '''
    # 2.6 三奇升殿、奇游禄位。-1
    # 乙（震）（开休生）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index == 2:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开" or zhishigongbamen[0] == "休" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yi_kaixiusheng_zhengsan
    # 丙（离）（开休生）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index == 8:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开" or zhishigongbamen[0] == "休" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bing_kaixiusheng_lijiu
    # 丁（兑）（开休生）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index == 6:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开" or zhishigongbamen[0] == "休" or zhishigongbamen == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + ding_kaixiusheng_duiqi
    # 丙（巽）（开休生）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index == 3:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开" or zhishigongbamen[0] == "休" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bing_kaixiusheng_xunsi
    # 丁（离）（开休生）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index == 8:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开" or zhishigongbamen[0] == "休" or zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + ding_kaixiusheng_lijiu

    # 2.7 奇仪相合  加0 故不考虑
    # 2.8 交泰格、天运格。-1
    # 乙十丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiding
    # 丁十丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingbing
    # 丁十乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingyi
    # 2.9 欢怡、相佐
    # 乙、丙、丁十六甲值符 去掉丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁" or zhishigongtianpanlist[0] == "乙" or \
                zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁" or zhishigongtianpan == "乙":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiordingjiaziwu
    # 六甲值符十乙、丙、丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙" or zhishigongdipanlist[0] == "丁" or \
                zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙" or zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwuyiording
    # 2.10 凶格
    # 庚十丙+3
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengbing
    # 丙十庚+3
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + binggeng

    # 乙 十 辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin

    # 辛十乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinyi

    # 癸十丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiding

    # 丁十癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dinggui

    # 六甲值符十庚 改为甲子戊+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwugeng

    # 庚十六甲值符 改为庚十甲子戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengjiaziwu

    # 2.11 其他凶格
    # 刑格 庚+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengji

    # 大格 庚+癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + genggui

    # 小格 庚+壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengren

    # 岁格 庚 +年干
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    niangan = nianganzhi[0]
    zhishigongdipangan1 = zhishigongdipan
    zhishigongdipangan2 = zhishigongdipan
    if len(zhishigongdipan) == 1:
        if niangan == zhishigongdipan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipangan = "甲"
            else:
                zhishigongdipangan = "戊"
        else:
            zhishigongdipangan = zhishigongdipan[-1]
        if zhishigongdipangan == niangan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipangan1 == zhishigongdipanlist[0]
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan1 = "甲"
                else:
                    zhishigongdipangan1 = "戊"
            else:
                zhishigongdipangan1 = zhishigongdipanlist[-1]
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipangan2 == zhishigongdipanlist[1]
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan2 = "甲"
                else:
                    zhishigongdipangan2 = "戊"
            else:
                zhishigongdipangan2 = zhishigongdipanlist[-1]
        if zhishigongdipangan1 == niangan or zhishigongdipangan2 == niangan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengniangan
    #  月格 庚+月干
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    yuegan = yueganzhi[0]
    zhishigongdipangan1 = zhishigongdipan
    zhishigongdipangan2 = zhishigongdipan
    if len(zhishigongdipan) == 1:
        if yuegan == zhishigongdipan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipangan = "甲"
            else:
                zhishigongdipangan = "戊"
        else:
            zhishigongdipangan = zhishigongdipan[-1]
        if zhishigongdipangan == yuegan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipangan1 == zhishigongdipanlist[0]
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan1 = "甲"
                else:
                    zhishigongdipangan1 = "戊"
            else:
                zhishigongdipangan1 = zhishigongdipanlist[-1]
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipangan2 == zhishigongdipanlist[1]
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan2 = "甲"
                else:
                    zhishigongdipangan2 = "戊"
            else:
                zhishigongdipangan2 = zhishigongdipanlist[-1]
        if zhishigongdipangan1 == yuegan or zhishigongdipangan2 == yuegan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengyuegan
    # 日格 庚+日干
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    rigan = riganzhi[0]
    zhishigongdipangan1 = zhishigongdipan
    zhishigongdipangan2 = zhishigongdipan
    if len(zhishigongdipan) == 1:
        if rigan == zhishigongdipan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipangan = "甲"
            else:
                zhishigongdipangan = "戊"
        else:
            zhishigongdipangan = zhishigongdipan[-1]
        if zhishigongdipangan == rigan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipangan1 == zhishigongdipanlist[0]
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan1 = "甲"
                else:
                    zhishigongdipangan1 = "戊"
            else:
                zhishigongdipangan1 = zhishigongdipanlist[-1]
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipangan2 == zhishigongdipanlist[1]
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan2 = "甲"
                else:
                    zhishigongdipangan2 = "戊"
            else:
                zhishigongdipangan2 = zhishigongdipanlist[-1]
        if zhishigongdipangan1 == rigan or zhishigongdipangan2 == rigan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengrigan
    # 时格 庚+时干
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    shichenggan = shichengganzhi[0]
    zhishigongdipangan1 = zhishigongdipan
    zhishigongdipangan2 = zhishigongdipan
    if len(zhishigongdipan) == 1:
        if shichenggan == zhishigongdipan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipangan = "甲"
            else:
                zhishigongdipangan = "戊"
        else:
            zhishigongdipangan = zhishigongdipan[-1]
        if zhishigongdipangan == shichenggan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipangan1 == zhishigongdipanlist[0]
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan1 = "甲"
                else:
                    zhishigongdipangan1 = "戊"
            else:
                zhishigongdipangan1 = zhishigongdipanlist[-1]
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipangan2 == zhishigongdipanlist[1]
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan2 = "甲"
                else:
                    zhishigongdipangan2 = "戊"
            else:
                zhishigongdipangan2 = zhishigongdipanlist[-1]
        if zhishigongdipangan1 == shichenggan or zhishigongdipangan2 == shichenggan:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengshigan
    # 飞干格 日干+庚
    rigan = riganzhi[0]
    zhishigongtianpangan1 = zhishigongtianpan
    zhishigongtianpangan2 = zhishigongtianpan
    if len(zhishigongtianpan) == 1:           
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpangan = "甲"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        if zhishigongtianpangan == rigan:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 == zhishigongtianpanlist[0]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "甲"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[-1]
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 == zhishigongtianpanlist[1]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "甲"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[-1]
        if zhishigongtianpangan1 == rigan or zhishigongtianpangan2 == rigan:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongdipanjishu == 1 and zhishigongtianpanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rigangeng
    '''
    #2.12 三奇入墓 时干入墓
    # 乙（乾、坤）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="乙" or zhishigongtianpanlist[1]=="乙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="乙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index==5 or zhishigongdingwei_index==1:
        zhishigonggonghaojishu=1
    else:
        zhishigonggonghaojishu=0

    if zhishigongtianpanjishu1==1 and zhishigonggonghaojishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+yi_qiankun
    #丙（乾）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丙" or zhishigongtianpanlist[1]=="丙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index==5:
        zhishigonggonghaojishu=1
    else:
        zhishigonggonghaojishu=0

    if zhishigongtianpanjishu1==1 and zhishigonggonghaojishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+bing_qianliu
    # 丁（艮、乾）
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="丁" or zhishigongtianpanlist[1]=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="丁":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if zhishigongdingwei_index==5 or zhishigongdingwei_index==7:
        zhishigonggonghaojishu=1
    else:
        zhishigonggonghaojishu=0

    if zhishigongtianpanjishu1==1 and zhishigonggonghaojishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+ding_genqian
    #时干 戊戌
    shiganjishu=0
    if shichengganzhi=="戊戌":
        shiganjishu=1
    else:
        shiganjishu=0
    if shiganjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+shiganwuxu
    #时干 壬辰
    if shichengganzhi=="壬辰":
        shiganjishu=1
    else:
        shiganjishu=0
    if shiganjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+shiganrencheng
    # 时干 丙戌
    if shichengganzhi=="丙戌":
        shiganjishu=1
    else:
        shiganjishu=0
    if shiganjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+shiganbingxu
    # 时干 癸未
    if shichengganzhi=="癸未":
        shiganjishu=1
    else:
        shiganjishu=0
    if shiganjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+shiganguiwei
    #时干 丁丑
    if shichengganzhi=="丁丑":
        shiganjishu=1
    else:
        shiganjishu=0
    if shiganjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+shigandingchou
    '''
    # 2.13 六仪击刑
    # 甲子戊（震）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 2:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwu_zhengsan
    # 甲戌己（坤）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 2:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaxuji_kuner
    # 甲申庚（艮）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 7:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiashengeng_genba
    # 甲午辛（离）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 8:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiawuxin_lijiu
    # 甲辰壬（巽）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 3:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiachenren_xunsi
    # 甲寅癸（巽）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if zhishigongdingwei_index == 3:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0

    if zhishigongtianpanjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiayingui_xunsi
    # 2.14 奇格
    # 庚+乙、丙、丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙" or zhishigongdipanlist[0] == "丁" or \
                zhishigongdipanlist[1] == "丁" or zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙" or zhishigongdipan == "丁" or zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengyiorbingording
    # 2.15 天网
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guigui
    # 五不遇时+1，若遇奇门吉格为有救用0
    # 其他格
    # 甲
    jimen = ["开使", "休使", "生使","开", "休", "生"]
    xiongmen = ["死使", "惊使", "伤使", "杜使","死", "惊", "伤", "杜"]
    qitamen = ["死使", "惊使", "伤使", "杜使", "景使","死", "惊", "伤", "杜", "景"]
    xiongxin = ["天蓬", "天芮", "天柱"]
    menpo = {"惊使": "23", "开使": "23", "休使": "8", "生使": "0", "死使": "0", "景使": "56", "杜使": "17",
             "伤使": "17","惊": "23", "开": "23", "休": "8", "生": "0", "死": "0", "景": "56", "杜": "17",
             "伤": "17"}
    gongpo = {6: ["杜使", "伤使","杜", "伤"], 5: ["杜使", "伤使","杜", "伤"], 0: ["景使","景"], 7: ["休使","休"], 1: ["休使","休"], 8: ["惊使", "开使","惊", "开"],
              3: ["生使", "死使","生", "死"], 2: ["生使", "死使","生", "死"]}
    mengongxiangshen = {"惊使": "17", "开使": "17", "休使": "56", "生使": "8", "死使": "8", "景使": "23", "杜使": "0",
                        "伤使": "0","惊": "17", "开": "17", "休": "56", "生": "8", "死": "8", "景": "23", "杜": "0",
                        "伤": "0"}
    '''
    #甲十乙(门吉)
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="乙" or zhishigongdipanlist[1]=="乙" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==1:
        if zhishigongdipan=="乙" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0
    bamenjilijishu=0
    if zhishigongbamen in jimen:
        bamenjilijishu=1
    else:
        bamenjilijishu=0

    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and bamenjilijishu==1 :
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiayi_jimen
    #甲十乙(门凶)
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="乙" or zhishigongdipanlist[1]=="乙" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==1:
        if zhishigongdipan=="乙" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0
    bamenxiongjishu=0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu=1
    else:
        bamenxiongjishu=0

    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and bamenxiongjishu==1 :
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiayi_xiongmen
    #甲十辛（门凶）
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="甲午辛" or zhishigongdipanlist[1]=="甲午辛":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==3:
        if zhishigongdipan=="甲午辛":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0

    bamenxiongjishu=0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu=1
    else:
        bamenxiongjishu=0

    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and bamenxiongjishu==1 :
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiaxin_xiongmen
    #甲+壬
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="甲辰壬" or zhishigongdipanlist[1]=="甲辰壬":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==3:
        if zhishigongdipan=="甲辰壬":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0
    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 :
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiaren
    #甲+癸(门吉)
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="甲寅癸" or zhishigongdipanlist[1]=="甲寅癸":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==3:
        if zhishigongdipan=="甲寅癸":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0

    bamenjilijishu=0
    if zhishigongbamen in jimen:
        bamenjilijishu=1
    else:
        bamenjilijishu=0
    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and bamenjilijishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiagui_jimen
    #甲+癸(门凶)
    if len(zhishigongtianpan)==1:
        zhishigongtianpanjishu=0
    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpanjishu=1
            else:
                zhishigongtianpanjishu=0
        else:
            zhishigongtianpanjishu=0
    else:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0])==1:
            zhishigongtianpanjishu1=0
        elif len(zhishigongtianpanlist[0])==3:
            if zhishigongtianpanlist[0]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu1=1
                else:
                    zhishigongtianpanjishu1=0
            else:
                zhishigongtianpanjishu1=0
        if len(zhishigongtianpanlist[1])==1:
            zhishigongtianpanjishu2=0
        elif len(zhishigongtianpanlist[1])==3:
            if zhishigongtianpanlist[1]=="甲子戊":
                if zhishigongbashen=="值符":
                    zhishigongtianpanjishu2=1
                else:
                    zhishigongtianpanjishu2=0
            else:
                zhishigongtianpanjishu2=0
        if zhishigongtianpanjishu1==1 or zhishigongtianpanjishu2==1:
            zhishigongtianpanjishu=1
        else:
            zhishigongtianpanjishu=0
    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="甲寅癸" or zhishigongdipanlist[1]=="甲寅癸":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==3:
        if zhishigongdipan=="甲寅癸":
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0

    bamenxiongjishu=0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu=1
    else:
        bamenxiongjishu=0

    if zhishigongtianpanjishu==1 and zhishigongdipanjishu==1 and bamenxiongjishu==1:
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiagui_xiongmen
    '''
    # 2.17.2 乙
    # 乙+甲
    zhishigongdipanjishu1 = 0
    zhishigongdipanjishu2 = 0
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yijia
    # 乙+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    zhishigongjiuxin = zhishigongshuju["九星"]
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and zhishigongbamen in xiongmen and zhishigongjiuxin in xiongxin:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yibing_xiongmenxiongxin
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and zhishigongbamen not in xiongmen and zhishigongjiuxin not in xiongxin:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yibing
    '''
    #乙+丁
    if len(zhishigongtianpan)>3:
        zhishigongtianpanlist=zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0]=="乙" or zhishigongtianpanlist[1]=="乙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    elif len(zhishigongtianpan)==1:
        if zhishigongtianpan=="乙":
            zhishigongtianpanjishu1=1
        else:
            zhishigongtianpanjishu1=0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan)>3:
        zhishigongdipanlist=zhishigongdipan.split("\n")
        if zhishigongdipanlist[0]=="丁" or zhishigongdipanlist[1]=="丁" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    elif len(zhishigongdipan)==1:
        if zhishigongdipan=="丁" :
            zhishigongdipanjishu=1
        else:
            zhishigongdipanjishu=0
    else:
        zhishigongdipanjishu=0
    if zhishigongtianpanjishu1==1 and zhishigongdipanjishu==1 :
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+yiding
        if yiding >= 0:
            yiding = f"+{yiding}"
        print(f"乙+丁--->{yiding}")
    else:
        print(f"乙+丁 --->没有出现")
        '''
    # 乙+戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 1
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 1
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1 and str(
            zhishigongdingwei_index) in menpo[zhishigongbamen]:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiwu
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 0 and str(
            zhishigongdingwei_index) not in menpo[zhishigongbamen]:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiwu

    # 乙+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiji_jimen
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiji_jimenchuwai
    # 乙+庚（巽宫，开门）
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongdingwei_index == 3:
        zhishigonggonghaojishu = 1
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "开":
        zhishigongbamenjishu = 1
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigeng_kai_xun
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu == 0 and zhishigonggonghaojishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigeng_qita
    # 乙＋辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongdingwei_index == 7:
        zhishigonggonghaojishu = 1
    elif zhishigongdingwei_index == 1:
        zhishigonggonghaojishu = 11
    else:
        zhishigonggonghaojishu = 0
    if zhishigongbamen[0] == "生":
        zhishigongbamenjishu = 1
    elif zhishigongbamen[0] == "开":
        zhishigongbamenjishu = 11
    else:
        zhishigongbamenjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and zhishigongbamenjishu == 1 and zhishigonggonghaojishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_sheng_gen
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 11 and zhishigongbamenjishu == 11 and zhishigonggonghaojishu == 11:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_kai_kun
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 11 and zhishigongbamenjishu == 0 and zhishigonggonghaojishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yixin_qita
    # 乙十壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0

    if zhishigongbamen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiren_xiongmen
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yiren_jimen
    # 乙十癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "乙" or zhishigongtianpanlist[1] == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "乙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigui_jimen
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + yigui_qita
    # 2.17.3 丙
    # 丙+乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingyi
    # 丙+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingbing
    # 丙+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingji_jimen
    elif zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingji_xiongmen
    # 丙+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingxin
    # 丙+壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bingren
    # 丙+癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丙" or zhishigongtianpanlist[1] == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丙":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + binggui
    # 2.17.4 丁
    # 丁+甲
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingjia
    # 丁+丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingding
    # 丁+戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 1
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 1
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingwu
    # 丁+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingji
    # 丁+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dinggeng
    # 丁+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "丁" or zhishigongtianpanlist[1] == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    elif len(zhishigongtianpan) == 1:
        if zhishigongtianpan == "丁":
            zhishigongtianpanjishu1 = 1
        else:
            zhishigongtianpanjishu1 = 0
    else:
        zhishigongtianpanjishu1 = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu1 == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + dingxin
    # 2.17.5 戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲子戊" or zhishigongtianpanlist[1] == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wujia_jimen
    # 戊+乙
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0
        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0

    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongbamen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuyi_jimen
    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuyi_xiongmen
    # 戊＋丁
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0
        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuding
    # 戊+戊
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu == 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0
        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲子戊" or zhishigongdipanlist[1] == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuwu
    # 戊+辛
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0
        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbashen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongbashen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuxin_jimen
    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuxin_xiongmen
    # 戊+壬
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0

        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + wuren
    # 戊+癸
    if len(zhishigongtianpan) == 1:
        zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpanjishu = 0
            else:
                zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpanjishu1 = 0
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu1 = 0
                else:
                    zhishigongtianpanjishu1 = 1
            else:
                zhishigongtianpanjishu1 = 0
        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpanjishu2 = 0
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpanjishu2 = 0
                else:
                    zhishigongtianpanjishu2 = 1
            else:
                zhishigongtianpanjishu2 = 0
        if zhishigongtianpanjishu1 == 1 or zhishigongtianpanjishu2 == 1:
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    mengongxiangshengjishu = 0
    if str(zhishigongdingwei_index) in mengongxiangshen[zhishigongbamen]:
        mengongxiangshengjishu = 1
    else:
        mengongxiangshengjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and mengongxiangshengjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwugui_mengongxiangshen
    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and mengongxiangshengjishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiaziwugui
    # 2.17.6 己
    # 己+甲
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 == 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jijia
    # 己+乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiyi
    # 己+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jibing
    # 己+丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiding
    # 己+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiji
    # 己+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jigeng
    # 己+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jixin
    # 己+壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiren

    # 己+癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲戌己" or zhishigongtianpanlist[1] == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲戌己":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jigui

    # 2.17.7 庚
    # 庚+丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengding_jimen

    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengding
    # 庚+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + genggeng
    # 庚+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲申庚" or zhishigongtianpanlist[1] == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲申庚":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + gengxin

    # 2.17.8 辛

    # 辛+甲
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 == 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinjia

    # 辛+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinbing_qita

    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinbing_qita

    # 辛+丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinding

    # 辛+戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 1
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 1
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinwu

    # 辛+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinji
    # 辛+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xingeng

    # 辛+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinxin
    # 辛+壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xinren

    # 辛+癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲午辛" or zhishigongtianpanlist[1] == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲午辛":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + xingui

    # 2.17.9  壬
    # 壬+甲
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renjia

    # 壬+乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renyi

    # 壬+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renbing
    # 壬+戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 1
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 1
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renwu

    # 壬+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renji

    # 壬+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + renxin

    # 壬+癸
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲辰壬" or zhishigongtianpanlist[1] == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲辰壬":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲寅癸" or zhishigongdipanlist[1] == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲寅癸":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + rengui

    # 2.17.10 癸

    # 癸+甲
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0

    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu = 0
            else:
                zhishigongdipanjishu = 0
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 0
            else:
                zhishigongdipanjishu1 = 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 0
            else:
                zhishigongdipanjishu2 = 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guijia

    # 癸+乙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "乙" or zhishigongdipanlist[1] == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "乙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongbamen in jimen:
        bamenjilijishu = 1
    else:
        bamenjilijishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiyi_jimen

    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenjilijishu == 0:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiyi_qita
    # 癸+丙
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丙" or zhishigongdipanlist[1] == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丙":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guibing
    # 癸+丁
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "丁" or zhishigongdipanlist[1] == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 1:
        if zhishigongdipan == "丁":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiding

    # 癸+戊
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) == 1:
        zhishigongdipanjishu == 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongdipanjishu == 0
            else:
                zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu == 0
    else:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if len(zhishigongdipanlist[0]) == 1:
            zhishigongdipanjishu1 = 0
        elif len(zhishigongdipanlist[0]) == 3:
            if zhishigongdipanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu1 = 0
                else:
                    zhishigongdipanjishu1 = 1
            else:
                zhishigongdipanjishu1 == 0
        if len(zhishigongdipanlist[1]) == 1:
            zhishigongdipanjishu2 = 0
        elif len(zhishigongdipanlist[1]) == 3:
            if zhishigongdipanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipanjishu2 = 0
                else:
                    zhishigongdipanjishu2 = 1
            else:
                zhishigongdipanjishu2 == 0
        if zhishigongdipanjishu1 == 1 or zhishigongdipanjishu2 == 1:
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0

    if zhishigongbamen in xiongmen:
        bamenxiongjishu = 1
    else:
        bamenxiongjishu = 0

    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1 and bamenxiongjishu == 1 and (
            str(zhishigongdingwei_index) in menpo[zhishigongbamen]) and (
            zhishigongbamen in gongpo[zhishigongdingwei_index]):
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiwu_xiongmenpozhi
    elif zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiwu
    # 癸+己
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲戌己" or zhishigongdipanlist[1] == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲戌己":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiji
    # 癸+庚
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲申庚" or zhishigongdipanlist[1] == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲申庚":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guigeng
    # 癸+辛
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲午辛" or zhishigongdipanlist[1] == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲午辛":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guixin
    # 癸+壬
    if len(zhishigongtianpan) > 3:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if zhishigongtianpanlist[0] == "甲寅癸" or zhishigongtianpanlist[1] == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲寅癸":
            zhishigongtianpanjishu = 1
        else:
            zhishigongtianpanjishu = 0
    else:
        zhishigongtianpanjishu = 0
    if len(zhishigongdipan) > 3:
        zhishigongdipanlist = zhishigongdipan.split("\n")
        if zhishigongdipanlist[0] == "甲辰壬" or zhishigongdipanlist[1] == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    elif len(zhishigongdipan) == 3:
        if zhishigongdipan == "甲辰壬":
            zhishigongdipanjishu = 1
        else:
            zhishigongdipanjishu = 0
    else:
        zhishigongdipanjishu = 0
    if zhishigongtianpanjishu == 1 and zhishigongdipanjishu == 1:
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + guiren
    jixionggejishuzuizhong = SpaDigiX_APPONE_Value - jixionggejishuchushi
    # -----------------------------------------------------------------------------------------------------------------------
    # 3 单宫天盘干定数

    # 十二个月份各干定数
    # -----------------------------------------------------------------------------------------------------------------------
    dangongtianpangandingshuchushi = SpaDigiX_APPONE_Value
    for key in month_dict_dangongtianpangandingshu:
        if key == yueganzhi[1]:
            yuefen = key
            yuefen_dangongtianpangandingshu = month_dict_dangongtianpangandingshu[key]
        else:
            pass
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in yuefen_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                shieryuefengegandingshu = yuefen_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in yuefen_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                shieryuefengegandingshu = yuefen_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        # 1
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    shieryuefengegandingshu1 = yuefen_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    shieryuefengegandingshu1 = yuefen_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    shieryuefengegandingshu2 = yuefen_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
            for key in yuefen_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    shieryuefengegandingshu2 = yuefen_dangongtianpangandingshu[key]
        shieryuefengegandingshu = (shieryuefengegandingshu2 + shieryuefengegandingshu1) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + shieryuefengegandingshu
    # 九宫各天盘干定数
    # -----------------------------------------------------------------------------------------------------------------------
    gongweixuhaoduiying = {0: "坎一宫", 1: "坤二宫", 2: "震三宫", 3: "巽四宫", 5: "乾六宫", 6: "兑七宫", 7: "艮八宫",
                           8: "离九宫"}
    for key in palace_dict_dangongtianpangandingshu:
        if key == zhishigongdingwei_index:
            gongming = gongweixuhaoduiying[key]
            gongwei_dangongtianpangandingshu = palace_dict_dangongtianpangandingshu[key]
        else:
            pass
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in gongwei_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                jiugonggetianpangandingshu = gongwei_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in gongwei_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                jiugonggetianpangandingshu = gongwei_dangongtianpangandingshu[key]
                SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        # 1
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    jiugonggetianpangandingshu1 = gongwei_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan1 == key:
                    jiugonggetianpangandingshu1 = gongwei_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    jiugonggetianpangandingshu2 = gongwei_dangongtianpangandingshu[key]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
            for key in gongwei_dangongtianpangandingshu:
                if zhishigongtianpangan2 == key:
                    jiugonggetianpangandingshu2 = gongwei_dangongtianpangandingshu[key]
        jiugonggetianpangandingshu = (jiugonggetianpangandingshu2 + jiugonggetianpangandingshu1) / 2
        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiugonggetianpangandingshu
    # -----------------------------------------------------------------------------------------------------------------------
    #天盘干与八门影响因素
    data = {
        "甲": {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 0, "死": 1, "惊": 1},
        "乙": {"开": 1, "休": -1, "生": 1, "伤": -1, "杜": -1, "景": 0, "死": 1, "惊": 1},
        "丙": {"开": 1, "休": 1, "生": 0, "伤": -1, "杜": -1, "景": -1, "死": 0, "惊": 1},
        "丁": {"开": 1, "休": 1, "生": 0, "伤": -1, "杜": -1, "景": -1, "死": 0, "惊": 1},
        "戊": {"开": 0, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 0},
        "己": {"开": 0, "休": 1, "生": -1, "伤": 1, "杜": 1, "景": -1, "死": -1, "惊": 0},
        "庚": {"开": -1, "休": 0, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "辛": {"开": -1, "休": 0, "生": -1, "伤": 1, "杜": 1, "景": 1, "死": -1, "惊": -1},
        "壬": {"开": -1, "休": -1, "生": 1, "伤": 0, "杜": 0, "景": 1, "死": 1, "惊": -1},
        "癸": {"开": -1, "休": -1, "生": 1, "伤": 0, "杜": 0, "景": 1, "死": 1, "惊": -1},
    }
    if len(zhishigongtianpan)==1:
        xuanzeganmendist=data[zhishigongtianpan]
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+xuanzeganmendist[zhishigongbamen[0]]
    elif len(zhishigongtianpan)==3:
        xuanzeganmendist=data[zhishigongtianpan[-1]]
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+xuanzeganmendist[zhishigongbamen[0]]
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        xuanze1ganmendist=data[zhishigongtianpanlist[0][-1]]
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+xuanze1ganmendist[zhishigongbamen[0]]/2
        xuanze2ganmendist=data[zhishigongtianpanlist[1][-1]]
        SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+xuanze2ganmendist[zhishigongbamen[0]]/2
    # 天盘干与地盘干五行力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # -----------------------------------------------------------------------------------------------------------------------
    if len(zhishigongtianpan) == 1:
        zhishigongtianpangan = zhishigongtianpan
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                tianpandingwei_dipan_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
            tiandiwuxingliliangxiaozhangdingshu = (
                                                              tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu2) / 2
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
    elif len(zhishigongtianpan) == 3:
        if zhishigongtianpan == "甲子戊":
            if zhishigongbashen == "值符":
                zhishigongtianoangan = "戊"
            else:
                zhishigongtianpangan = "戊"
        else:
            zhishigongtianpangan = zhishigongtianpan[-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan == key:
                tianpandingwei_dipan_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan_dangongtianpangandingshu[key]
            tiandiwuxingliliangxiaozhangdingshu = (
                                                              tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu2) / 2
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + tiandiwuxingliliangxiaozhangdingshu
    else:
        zhishigongtianpanlist = zhishigongtianpan.split("\n")
        if len(zhishigongtianpanlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanlist[0]
        elif len(zhishigongtianpanlist[0]) == 3:
            if zhishigongtianpanlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanlist[0][-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan1 == key:
                tianpandingwei_dipan2_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass
        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                else:
                    pass
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu1 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan2_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan2_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu2 = tianpandingwei_dipan2_dangongtianpangandingshu[key]

        if len(zhishigongtianpanlist[1]) == 1:
            zhishigongtianpangan2 = zhishigongtianpanlist[1]
        elif len(zhishigongtianpanlist[1]) == 3:
            if zhishigongtianpanlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanlist[1][-1]
        for key in tianpandingwei_dict_dangongtianpangandingshu:
            if zhishigongtianpangan2 == key:
                tianpandingwei_dipan3_dangongtianpangandingshu = tianpandingwei_dict_dangongtianpangandingshu[key]
            else:
                pass

        if len(zhishigongdipan) == 1:
            zhishigongdipangan = zhishigongdipan
            for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                else:
                    pass
        elif len(zhishigongdipan) == 3:
            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                if zhishigongdipangan == key:
                    tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
        elif len(zhishigongdipan) > 3:
            zhishigongdipanlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanlist[0]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[0]) == 3:
                if zhishigongdipanlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanlist[0][-1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan1 == key:
                        tiandiwuxingliliangxiaozhangdingshu3 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            if len(zhishigongdipanlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanlist[1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu4 = tianpandingwei_dipan3_dangongtianpangandingshu[key]
                    else:
                        pass
            elif len(zhishigongdipanlist[1]) == 3:
                if zhishigongdipanlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanlist[1][-1]
                for key in tianpandingwei_dipan3_dangongtianpangandingshu:
                    if zhishigongdipangan2 == key:
                        tiandiwuxingliliangxiaozhangdingshu4 = tianpandingwei_dipan3_dangongtianpangandingshu[key]

        try:
            # 尝试获取变量的值
            variable_value = zhishigongdipangan
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + (
                    tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu3) / 2
        except NameError:
            SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + (
                    tiandiwuxingliliangxiaozhangdingshu1 + tiandiwuxingliliangxiaozhangdingshu2 + tiandiwuxingliliangxiaozhangdingshu3 + tiandiwuxingliliangxiaozhangdingshu4) / 4
    dangongtianpangandingshuzuizhong = SpaDigiX_APPONE_Value - dangongtianpangandingshuchushi

    dangongjiuxingliliangjishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    jixing = ["天辅", "天禽", "天心", "天任"]
    xiongxing = ["天蓬", "天芮", "天柱"]
    # 十二月各星力量
    # 各星力量
    zhishigongjiuxing = zhishigongshuju["九星"]
    for key in yuefenduiyingjiuxingliliang:
        if yueganzhi[1] == key:
            yuefenduiyingjiuxingliliang_benyuelist = yuefenduiyingjiuxingliliang[key]
    jiuxinggeyueliliangdingshu = yuefenduiyingjiuxingliliang_benyuelist[zhishigongjiuxing]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxinggeyueliliangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 4.2 九宫各星力量
    # -----------------------------------------------------------------------------------------------------------------------
    # 九宫各星力量数据
    zhishiduiyinggongjiuxingdist = jiugonggexingliliangshuju[zhishigongdingwei_index]
    zhishigongduiyingjiuxingliliangdingshu = zhishiduiyinggongjiuxingdist[zhishigongjiuxing]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + zhishigongduiyingjiuxingliliangdingshu
    '''
    #吉凶星变化
    zhishiqijiuxingtianpangan1=0
    zhishiqijiuxingtianpangan2=0
    jiuxingduiyingtianpanganzidian=jiuxingyutianpanganbianhuashuju[zhishigongjiuxing]
    if len(zhishigongtianpan)==1:
        for key in jiuxingduiyingtianpanganzidian:
            if key==zhishigongtianpan:
                zhishiqijiuxingtianpangan1=1
                jiuxingtianpangandingshu=jiuxingduiyingtianpanganzidian[key]
                SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiuxingtianpangandingshu
            else:
                pass

    elif len(zhishigongtianpan)==3:
        if zhishigongtianpan=="甲子戊":
            if zhishigongbashen=="值符":
                zhishigongtianpangan="甲"
            else:
                zhishigongtianpangan="戊"
        else:
            zhishigongtianpangan=zhishigongtianpan[-1]
        for key in jiuxingduiyingtianpanganzidian:
            if key==zhishigongtianpangan:
                zhishiqijiuxingtianpangan1=1
                jiuxingtianpangandingshu=jiuxingduiyingtianpanganzidian[key]
                SpaDigiX_APPONE_Value=SpaDigiX_APPONE_Value+jiuxingtianpangandingshu
            else:
                pass
    else:
        zhishigongtianpanganlist=zhishigongtianpan.split("\n")
        if len(zhishigongtianpanganlist[0]) == 1:
            zhishigongtianpangan1 = zhishigongtianpanganlist[0]
            for key in jiuxingduiyingtianpanganzidian:
                if key == zhishigongtianpanganlist[0]:
                    zhishiqijiuxingtianpangan1 = 1

                    jiuxingtianpangandingshu1 = jiuxingduiyingtianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxingtianpangandingshu1
                else:
                    pass
        elif len(zhishigongtianpanganlist[0]) == 3:
            if zhishigongtianpanganlist[0] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan1 = "甲"
                else:
                    zhishigongtianpangan1 = "戊"
            else:
                zhishigongtianpangan1 = zhishigongtianpanganlist[0][-1]
            for key in jiuxingduiyingtianpanganzidian:
                if key == zhishigongtianpangan1:
                    zhishiqijiuxingtianpangan1 = 1
                    jiuxingtianpangandingshu1 = jiuxingduiyingtianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxingtianpangandingshu1
                else:
                    pass

        if len(zhishigongtianpanganlist[1]) == 1:
            zhishigongtianpangan2=zhishigongtianpanganlist[1]
            for key in jiuxingduiyingtianpanganzidian:
                if key == zhishigongtianpanganlist[1]:
                    zhishiqijiuxingtianpangan2 = 1

                    jiuxingtianpangandingshu2 = jiuxingduiyingtianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxingtianpangandingshu2
                else:
                    pass
        elif len(zhishigongtianpanganlist[1]) == 3:
            if zhishigongtianpanganlist[1] == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan2 = "甲"
                else:
                    zhishigongtianpangan2 = "戊"
            else:
                zhishigongtianpangan2 = zhishigongtianpanganlist[1][-1]
            for key in jiuxingduiyingtianpanganzidian:
                if key == zhishigongtianpangan2:
                    zhishiqijiuxingtianpangan2 = 1
                    jiuxingtianpangandingshu2 = jiuxingduiyingtianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + jiuxingtianpangandingshu2
                else:
                    pass
    '''
    dangongjiuxingliliangjishuzuizhong = SpaDigiX_APPONE_Value - dangongjiuxingliliangjishuchushi
    # -----------------------------------------------------------------------------------------------------------------------
    # 5 单宫八门力量消长
    dangongbamenliliangjishuchushi = SpaDigiX_APPONE_Value
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.1 八门在十二个月的力量
    dangyuebamenzidian = bamenshieryueshuju[yueganzhi[1]]
    bamengeyueliliangdingshu = dangyuebamenzidian[zhishigongbamen[0]]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamengeyueliliangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.2 八门在九宫中的力量消长
    # -----------------------------------------------------------------------------------------------------------------------
    zhishigongduiyingmenzidian = bamenjiugongliliangxiaozhangshuju[zhishigongdingwei_index]
    bamenjiugongliliangxiaozhangdingshu = zhishigongduiyingmenzidian[zhishigongbamen[0]]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamenjiugongliliangxiaozhangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 5.3 几种特殊的门遇到天盘干，地盘干的力量变化
    # 天盘干
    teshumen = ["开", "休", "生", "死", "惊"]
    if zhishigongbamen[0] not in teshumen:
        pass
    else:
        zhishiqibamentianpangan1 = 0
        zhishiqibamentianpangan2 = 0
        menyutianpanganzidian = menyutianpanganshuju[zhishigongbamen[0]]
        if len(zhishigongtianpan) == 1:
            for key in menyutianpanganzidian:
                if key == zhishigongtianpan:
                    zhishiqibamentianpangan1 = 1
                    bamentianpangandingshu = menyutianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu
                else:
                    pass
        elif len(zhishigongtianpan) == 3:
            if zhishigongtianpan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongtianpangan = "戊"
                else:
                    zhishigongtianpangan = "戊"
            else:
                zhishigongtianpangan = zhishigongtianpan[-1]
            for key in menyutianpanganzidian:
                if key == zhishigongtianpangan:
                    zhishiqibamentianpangan1 = 1
                    bamentianpangandingshu = menyutianpanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu
                else:
                    pass
        else:
            zhishigongtianpanganlist = zhishigongtianpan.split("\n")
            if len(zhishigongtianpanganlist[0]) == 1:
                zhishigongtianpangan1 = zhishigongtianpanganlist[0]
                for key in menyutianpanganzidian:
                    if key == zhishigongtianpanganlist[0]:

                        zhishiqibamentianpangan1 = 1

                        bamentianpangandingshu1 = menyutianpanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu1 / 2
                    else:
                        pass
            elif len(zhishigongtianpanganlist[0]) == 3:
                if zhishigongtianpanganlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpangan1 = "戊"
                    else:
                        zhishigongtianpangan1 = "戊"
                else:
                    zhishigongtianpangan1 = zhishigongtianpanganlist[0][-1]
                for key in menyutianpanganzidian:
                    if key == zhishigongtianpangan1:
                        zhishiqibamentianpangan1 = 1
                        bamentianpangandingshu1 = menyutianpanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu1 / 2
                    else:
                        pass

            if len(zhishigongtianpanganlist[1]) == 1:
                zhishigongtianpangan2 = zhishigongtianpanganlist[1]
                for key in menyutianpanganzidian:
                    if key == zhishigongtianpanganlist[1]:
                        zhishiqibamentianpangan2 = 1

                        bamentianpangandingshu2 = menyutianpanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu2 / 2
                    else:
                        pass
            elif len(zhishigongtianpanganlist[1]) == 3:
                if zhishigongtianpanganlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongtianpangan2 = "戊"
                    else:
                        zhishigongtianpangan2 = "戊"
                else:
                    zhishigongtianpangan2 = zhishigongtianpanganlist[1][-1]
                for key in menyutianpanganzidian:
                    if key == zhishigongtianpangan2:
                        zhishiqibamentianpangan2 = 1
                        bamentianpangandingshu2 = menyutianpanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamentianpangandingshu2 / 2
                    else:
                        pass
        # 地盘干：
        zhishiqibamendipangan1 = 0
        zhishiqibamendipangan2 = 0
        menyudipanganzidian = menyudipanganshuju[zhishigongbamen[0]]
        if len(zhishigongdipan) == 1:

            for key in menyudipanganzidian:
                if key == zhishigongdipan:
                    zhishiqibamendipangan1 = 1
                    bamendipangandingshu = menyudipanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu
                else:
                    pass
        elif len(zhishigongdipan) == 3:

            if zhishigongdipan == "甲子戊":
                if zhishigongbashen == "值符":
                    zhishigongdipangan = "戊"
                else:
                    zhishigongdipangan = "戊"
            else:
                zhishigongdipangan = zhishigongdipan[-1]
            for key in menyudipanganzidian:
                if key == zhishigongdipangan:
                    zhishiqibamendipangan1 = 1
                    bamendipangandingshu = menyudipanganzidian[key]
                    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu

                else:
                    pass
        else:

            zhishigongdipanganlist = zhishigongdipan.split("\n")
            if len(zhishigongdipanganlist[0]) == 1:
                zhishigongdipangan1 = zhishigongdipanganlist[0]
                for key in menyudipanganzidian:
                    if key == zhishigongdipanganlist[0]:

                        zhishiqibamendipangan1 = 1

                        bamendipangandingshu1 = menyudipanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu1 / 2
                    else:
                        pass
            elif len(zhishigongdipanganlist[0]) == 3:
                if zhishigongdipanganlist[0] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan1 = "戊"
                    else:
                        zhishigongdipangan1 = "戊"
                else:
                    zhishigongdipangan1 = zhishigongdipanganlist[0][-1]
                for key in menyudipanganzidian:
                    if key == zhishigongdipangan1:
                        zhishiqibamendipangan1 = 1
                        bamendipangandingshu1 = menyudipanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu1 / 2
                    else:
                        pass

            if len(zhishigongdipanganlist[1]) == 1:
                zhishigongdipangan2 = zhishigongdipanganlist[1]
                for key in menyudipanganzidian:
                    if key == zhishigongdipanganlist[1]:
                        zhishiqibamendipangan2 = 1

                        bamendipangandingshu2 = menyudipanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu2 / 2
                    else:
                        pass
            elif len(zhishigongdipanganlist[1]) == 3:
                if zhishigongdipanganlist[1] == "甲子戊":
                    if zhishigongbashen == "值符":
                        zhishigongdipangan2 = "戊"
                    else:
                        zhishigongdipangan2 = "戊"
                else:
                    zhishigongdipangan2 = zhishigongdipanganlist[1][-1]
                for key in menyudipanganzidian:
                    if key == zhishigongdipangan2:
                        zhishiqibamendipangan2 = 1
                        bamendipangandingshu2 = menyudipanganzidian[key]
                        SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bamendipangandingshu2 / 2
                    else:
                        pass
    dangongbamenliliangjishuzuizhong = SpaDigiX_APPONE_Value - dangongbamenliliangjishuchushi
    # -----------------------------------------------------------------------------------------------------------------------
    # 6 八神单宫力量消长定数
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.1十二个月八神力量消长
    # -----------------------------------------------------------------------------------------------------------------------
    dangongbashenliliangjishuchushi = SpaDigiX_APPONE_Value
    dangyuebashenzidian = bashenshieryueliliangxiaozhangshuju[yueganzhi[1]]
    bashendangyueliliangxiaozhangdingshu = dangyuebashenzidian[zhishigongbashen]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bashendangyueliliangxiaozhangdingshu
    # -----------------------------------------------------------------------------------------------------------------------
    # 6.2 八神在九宫内力量消长
    # -----------------------------------------------------------------------------------------------------------------------

    zhishigongbashenzidian = bashenzaijiugongliliangxiaozhangshuju[zhishigongdingwei_index]
    bashendanggongdingshu = zhishigongbashenzidian[zhishigongbashen]
    SpaDigiX_APPONE_Value = SpaDigiX_APPONE_Value + bashendanggongdingshu
    dangongbashenliliangxiaozhangjishuzuizhong = SpaDigiX_APPONE_Value - dangongbashenliliangjishuchushi
    print("-----------------------------------------------------------------------------------------------------------------")
    return  SpaDigiX_APPONE_Value
